pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract AmharicLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "አለመሳካት");
        set(hex"01", "ስኬት");
        set(hex"02", "ሌሎች በመጠበቅ ላይ");
        set(hex"03", "ተቀባይነት አግኝቷል");
        set(hex"04", "የታችኛው ገደብ ወይም በቂ ያልሆነ");
        set(hex"05", "ተቀባይ እርምጃ ተጠይቋል");
        set(hex"06", "የላይኛው ገደብ");
        set(hex"08", "የተባዛ, Unnessesary, ወይም ስለማይኖራቸው");
        set(hex"0F", "የመረጃ ወይም ሜታዳታ");

        set(hex"10", "ተከልክሏል ወይም አቁም");
        set(hex"11", "ተፈቅዷል ወይም ሂድ");
        set(hex"12", "ሌሎች የአምላክ ፈቃድ በመጠባበቅ ላይ");
        set(hex"13", "ፈቃድ ተጠይቋል");
        set(hex"14", "ስጋትና / በጣም ክፈት");
        set(hex"15", "ቀጣይ የእርስዎ ፈቃድ ወይም ጥያቄ ያስፈልገዋል");
        set(hex"16", "ተሽሮ ወይም ታገደ");
        set(hex"18", "የአሁኑ ክልል ተፈጻሚ አይደለም");
        set(hex"1F", "የፍቃድ ዝርዝሮች ወይም የቁጥጥር ሁኔታዎች");

        set(hex"20", ", እንደተደረገብህ ተገኝቷል, ወይም ከክልል ውጭ አይደለም");
        set(hex"21", "አገኙ, እኩል ወይም ክልል ውስጥ");
        set(hex"22", "ግጥሚያ በመጠበቅ ላይ");
        set(hex"23", "የግጥሚያ ጥያቄ ተልኳል");
        set(hex"24", "ክልል ወይም Underflow በታች");
        set(hex"25", "አዛምድ ጥያቄ");
        set(hex"26", "ክልል ወይም የትርፍ በላይ");
        set(hex"28", "የተባዛ, ግጭት, ወይም ግጭት");
        set(hex"2F", "Meta ወይም መረጃ ተዛማጅ");

        set(hex"30", "የላኪ አይስማማም ወይም አይደለም");
        set(hex"31", "የላኪ የሚስማማ ወይም አዎን");
        set(hex"32", "በመጠባበቅ ላይ ማጽደቂያ");
        set(hex"33", "ቅናሽ የተላከ ወይም ድምጽ ሰጥተዋል");
        set(hex"34", "አባል ደርሷል አይደለም");
        set(hex"35", "የተቀባዩ ማፅደቂያ ተጠይቋል");
        set(hex"36", "ቅናሽ ወይም ድምጽ ወሰን ደርሷል");
        set(hex"38", "አስቀድሞ ሰጥተዋል");
        set(hex"3F", "ድርድር ደንቦች ወይም ተሳትፎ መረጃ");

        set(hex"40", "የማይገኝ");
        set(hex"41", "ይገኛል");
        set(hex"42", "ላፍታ ቆሟል");
        set(hex"43", "ተሰልፏል");
        set(hex"44", "አይደለም ይገኛል ሆኖም");
        set(hex"45", "የእርስዎ ተገኝነት በመጠባበቅ ላይ");
        set(hex"46", "ጊዜው አልፎበታል");
        set(hex"48", "አስቀድሞ ተከናውኗል");
        set(hex"4F", "ተገኝነት ደንቦች ወይም መረጃ (ለምሳሌ ጀምሮ ወይም ድረስ. ሰዓት)");

        set(hex"50", "ትልልፍ አልተሳካም");
        set(hex"51", "ስኬታማ ያስተላልፉ");
        set(hex"52", "ሌሎች ከ ክፍያ በመጠባበቅ ላይ");
        set(hex"53", "ያዝ ወይም የዋስትና ሰነድ");
        set(hex"54", "በቂ ያልሆኑ ገንዘቦች");
        set(hex"55", "ፈንድ ተጠይቋል");
        set(hex"56", "ማስተላለፍ ጥራዝ አልፏል");
        set(hex"58", "ፈንድ አያስፈልግም");
        set(hex"5F", "ማስመሰያ ወይም የገንዘብ መረጃ");

        set(hex"A0", "መተግበሪያ-ተኮር አለመሳካት");
        set(hex"A1", "መተግበሪያ-ተኮር ስኬት");
        set(hex"A2", "መተግበሪያ-ተኮር በመጠባበቅ ሌሎች");
        set(hex"A3", "መተግበሪያ-ተኮር ተቀባይነት");
        set(hex"A4", "ሁኔታ በታች መተግበሪያ-ተኮር");
        set(hex"A5", "መተግበሪያ-ተኮር ተቀባይ እርምጃ ተጠይቋል");
        set(hex"A6", "መተግበሪያ-ተኮር የሚቃጠልበት ወይም ገድብ");
        set(hex"A8", "መተግበሪያ-ተኮር የማይኖራቸው ሁኔታ");
        set(hex"AF", "መተግበሪያ-ተኮር Meta ወይም መረጃ");

        set(hex"E0", "አለመሳካት ዲክሪፕት");
        set(hex"E1", "ስኬት ዲክሪፕት");
        set(hex"E2", "ሌሎች ፊርማዎች ወይም ቁልፎች በመጠባበቅ ላይ");
        set(hex"E3", "ገብተዋል");
        set(hex"E4", "ያልተፈረመበት ወይም የማይታመን");
        set(hex"E5", "ፊርማ ያስፈልጋል");
        set(hex"E6", "የተነጠቁ ዘንድ ይታወቃል");
        set(hex"E8", "አስቀድመው ገብተዋል ወይም አይደለም የተመሳጠረ");
        set(hex"EF", "ክሪፕቶግራፊ, መታወቂያ, ወይም ማረጋገጫ ሜታዳታ");

        set(hex"F0", "Off-ሰንሰለት አለመሳካት");
        set(hex"F1", "Off-ሰንሰለት ስኬት");
        set(hex"F2", "በመጠባበቅ ላይ Off-ሰንሰለት ሂደት");
        set(hex"F3", "የ Off-ሰንሰለት ሂደት ተጀምሯል");
        set(hex"F4", "Off-ሰንሰለት አይደረስበትም አገልግሎት");
        set(hex"F5", "Off-ሰንሰለት እርምጃ ያስፈልጋል");
        set(hex"F6", "Off-ቼይን የሚቃጠልበት ወይም ወሰን ደርሷል");
        set(hex"F8", "አባዛ Off-ሰንሰለት ጥያቄ");
        set(hex"FF", "Off-ቼይን መረጃ ወይም Meta");
    }
}