pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract ArabicLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "بالفشل");
        set(hex"01", "نجاح");
        set(hex"02", "ينتظر آخرون");
        set(hex"03", "وافقت");
        set(hex"04", "الحد الأدنى أو غير كافية");
        set(hex"05", "استقبال الإجراء المطلوب");
        set(hex"06", "الحد الأعلى");
        set(hex"08", "مكررة، Unnessesary، أو غير القابلة للتطبيق");
        set(hex"0F", "إعلامية أو ميتا");

        set(hex"10", "غير مسموح بها أو وقف");
        set(hex"11", "يسمح أو الذهاب");
        set(hex"12", "ينتظر أخرى لإذن");
        set(hex"13", "إذن المطلوب");
        set(hex"14", "توسيع جدا / غير آمن");
        set(hex"15", "يحتاج إلى إذن منك أو طلب استمرار");
        set(hex"16", "إلغاء أو المحظورة");
        set(hex"18", "لا تنطبق على الوضع الحالي");
        set(hex"1F", "تفاصيل إذن أو شروط مراقبة");

        set(hex"20", "لم يتم العثور على، عدم المساواة، أو خارج النطاق");
        set(hex"21", "العثور على المساواة أو في المدى");
        set(hex"22", "في انتظار المباراة");
        set(hex"23", "المرسلة مباراة طلب");
        set(hex"24", "أدناه مجموعة أو تجاوز الحد الأدنى");
        set(hex"25", "طلب للحصول على المباراة");
        set(hex"26", "فوق المدى أو تجاوز");
        set(hex"28", "مكررة والصراع، أو التصادم");
        set(hex"2F", "مطابقة ميتا أو معلومات");

        set(hex"30", "يختلف المرسل أو ناي");
        set(hex"31", "المرسل يوافق أو نعم");
        set(hex"32", "في انتظار التصديق");
        set(hex"33", "عرض المرسلة أو صوت");
        set(hex"34", "النصاب القانوني لم تصل");
        set(hex"35", "التصديق المتلقي مطلوب");
        set(hex"36", "عرض أو أصوات تم الوصول إلى حد");
        set(hex"38", "صوت بالفعل");
        set(hex"3F", "قواعد التفاوض أو معلومات المشاركة");

        set(hex"40", "غير متوفره");
        set(hex"41", "متاح");
        set(hex"42", "توقف");
        set(hex"43", "في قائمة الانتظار");
        set(hex"44", "غير متاح حتى الآن");
        set(hex"45", "في انتظار تواجدك");
        set(hex"46", "منتهية الصلاحية");
        set(hex"48", "قد فعلت");
        set(hex"4F", "قوانين توافر أو معلومات (مثل وقت مضى منذ أو حتى)");

        set(hex"50", "فشل نقل");
        set(hex"51", "نقل ناجحة");
        set(hex"52", "في انتظار الدفع من أخرى");
        set(hex"53", "عقد أو الضمان");
        set(hex"54", "رصيد غير كاف");
        set(hex"55", "الأموال المطلوبة");
        set(hex"56", "نقل المجلد تجاوز");
        set(hex"58", "الأموال غير ضروري");
        set(hex"5F", "معلومات رمزية أو المالية");

        set(hex"A0", "فشل التطبيق المحدد");
        set(hex"A1", "النجاح التطبيق المحدد");
        set(hex"A2", "التطبيق المحددة لانتظار أخرى");
        set(hex"A3", "قبول التطبيق المحدد");
        set(hex"A4", "التطبيق المحددة أدناه الحالة");
        set(hex"A5", "التطبيق محددة استقبال الإجراء المطلوب");
        set(hex"A6", "التطبيق محددة انتهاء الصلاحية أو الحد");
        set(hex"A8", "التطبيق-محددة الحالة غير قابلة للتطبيق");
        set(hex"AF", "ميتا التطبيق-معينة أو معلومات");

        set(hex"E0", "فك تشفير الفشل");
        set(hex"E1", "فك تشفير النجاح");
        set(hex"E2", "تنتظر التواقيع أو مفاتيح أخرى");
        set(hex"E3", "وقعت");
        set(hex"E4", "غير موقعة أو غير موثوق");
        set(hex"E5", "التوقيع مطلوب");
        set(hex"E6", "من المعروف أن تم اختراقه");
        set(hex"E8", "توقيع مسبقا أو غير مشفرة");
        set(hex"EF", "الترميز، ID، أو الفوقية والدليل");

        set(hex"F0", "خارج سلسلة الفشل");
        set(hex"F1", "خارج سلسلة النجاح");
        set(hex"F2", "تنتظر خارج سلسلة عملية");
        set(hex"F3", "خارج سلسلة عملية كتبت");
        set(hex"F4", "خارج سلسلة خدمة لا يمكن الوصول");
        set(hex"F5", "خارج سلسلة الإجراءات المطلوبة");
        set(hex"F6", "خارج سلسلة انتهاء الصلاحية أو الحد وصلت");
        set(hex"F8", "تكرار خارج سلسلة طلب");
        set(hex"FF", "خارج سلسلة معلومات أو ميتا");
    }
}