pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract ArmenianLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "անհաջողություն");
        set(hex"01", "հաջողություն");
        set(hex"02", "սպասում է ուրիշներին");
        set(hex"03", "ընդունված");
        set(hex"04", "Ավելի ցածր Սահմանափակել կամ անբավարար");
        set(hex"05", "Ընդունիչ հայցվող գործողությունը");
        set(hex"06", "Վերին սահմանը");
        set(hex"08", "Duplicate, Unnessesary, կամ անկիրառելի");
        set(hex"0F", "Տեղեկատվական կամ Metadata");

        set(hex"10", "Չհաշվեցին կամ Stop");
        set(hex"11", "Թույլատրվում, թե գնալ");
        set(hex"12", "Սպասում է ուրիշինը թույլտվությունը");
        set(hex"13", "թույլտվություն");
        set(hex"14", "Էլ բաց / Անապահով");
        set(hex"15", "Անհրաժեշտ է ձեր թույլտվությունը կամ հարցման համար շարունակության");
        set(hex"16", "Ուժը կորցրած է ճանաչվել կամ արգելվել");
        set(hex"18", "Ոչ կիրառելի ներկա վիճակը");
        set(hex"1F", "Թույլտվության Մանրամասներ կամ վերահսկման պայմանները");

        set(hex"20", "Չի հայտնաբերվել, Անհավասար, կամ դուրս Լեռնաշղթայի");
        set(hex"21", "Գտել, Հավասար կամ In Range");
        set(hex"22", "սպասում է Match");
        set(hex"23", "Match Հայցն ուղարկված է");
        set(hex"24", "Ստորեւ բերված Range կամ underflow");
        set(hex"25", "Խնդրանքը համար Match");
        set(hex"26", "Վերը Range կամ տոգորվել");
        set(hex"28", "Duplicate, հակամարտությունը, կամ բախում");
        set(hex"2F", "Համապատասխանող Meta կամ Info");

        set(hex"30", "Ուղարկողը Համամիտ չէ կամ Nay");
        set(hex"31", "Ուղարկողը համաձայնել կամ Այո");
        set(hex"32", "սպասելով վավերացման");
        set(hex"33", "Առաջարկը Ուղարկված կամ քվեարկել");
        set(hex"34", "Քվորումը չի հասել");
        set(hex"35", "Ստացողի Վավերացումը Requested");
        set(hex"36", "Առաջարկը կամ քվեարկել Սահմանափակել Լրացել");
        set(hex"38", "արդեն քվեարկել");
        set(hex"3F", "Բանակցային կանոնների կամ մասնակցություն Info");

        set(hex"40", "անհասանելի");
        set(hex"41", "մատչելի");
        set(hex"42", "Ընդմիջված");
        set(hex"43", "Հերթում");
        set(hex"44", "Դեռ հասանելի չէ");
        set(hex"45", "Սպասում է Ձեր Հասանելիություն");
        set(hex"46", "Ժամկետանց");
        set(hex"48", "Արդեն արված է");
        set(hex"4F", "Հասանելիություն Օրենքները կամ Info (նախկին: դրույքով քանի, կամ մինչեւ)");

        set(hex"50", "փոխանցումը ձախողվեց");
        set(hex"51", "փոխանցել Հաջող");
        set(hex"52", "Սպասում է վճարում ՈՒրիշ");
        set(hex"53", "Անցկացնել կամ ավանդին");
        set(hex"54", "անբավարար Funds");
        set(hex"55", "միջոցները հարցմամբ");
        set(hex"56", "Տրանսֆեր Ծավալ գերազանցված");
        set(hex"58", "Միջոցները չի պահանջվում");
        set(hex"5F", "Կամ նշան Ֆինանսական տեղեկություններ");

        set(hex"A0", "App հատուկ Ձախողումը");
        set(hex"A1", "App հատուկ Success");
        set(hex"A2", "App-Հատուկ ՍՊԱՍՈՒՄ ԵՆ ՈՒրիշ");
        set(hex"A3", "App հատուկ ընդունում");
        set(hex"A4", "App հատուկ Ստորեւ վիճակը");
        set(hex"A5", "App հատուկ ընդունիչ հայցվող գործողությունը");
        set(hex"A6", "App հատուկ Expiry կամ Սահմանափակել");
        set(hex"A8", "App հատուկ inapplicable Վիճակը");
        set(hex"AF", "App հատուկ Meta կամ Info");

        set(hex"E0", "decrypt ձախողում");
        set(hex"E1", "decrypt հաջողությունը");
        set(hex"E2", "Սպասում է այլ ստորագրությունները կամ բանալիներ");
        set(hex"E3", "ստորագրել");
        set(hex"E4", "Չստորագրված կամ Անվստահելի");
        set(hex"E5", "ստորագրությունը Պահանջվող");
        set(hex"E6", "Ինչպես հայտնի է, վտանգել");
        set(hex"E8", "Արդեն ստորագրվել է, թե ոչ ծածկագրված");
        set(hex"EF", "Ծածկագիտություն, ID, կամ Proof Metadata");

        set(hex"F0", "Off-շղթայով Ձախողումը");
        set(hex"F1", "Off-շղթայով հաջողության");
        set(hex"F2", "Սպասում են Off-Chain Process");
        set(hex"F3", "Off-Chain գործընթացը սկսվել");
        set(hex"F4", "Off-շղթայի ծառայություն անհասանելի");
        set(hex"F5", "Off-շղթայով Action Պահանջվող");
        set(hex"F6", "Off-Chain գործողության ժամկետը լրանալու կամ սահմանափակել Լրացել");
        set(hex"F8", "Կրկնօրինակ Off-Chain հարցումը");
        set(hex"FF", "Off-Chain Info կամ Meta");
    }
}