pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract BelarusianLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "недастатковасць");
        set(hex"01", "поспех");
        set(hex"02", "У чаканні Іншыя");
        set(hex"03", "прынята");
        set(hex"04", "Ніжняя мяжа або Недастатковы");
        set(hex"05", "Прыёмнік Дзеянне Запытаны");
        set(hex"06", "верхняя мяжа");
        set(hex"08", "Дублікат, Unnessesary або неўжывальныя");
        set(hex"0F", "Інфармацыйны або метададзеных");

        set(hex"10", "Недапушчальны ці прыпынак");
        set(hex"11", "Дазволена або Go");
        set(hex"12", "Чаканне Іншага Дазвол");
        set(hex"13", "дазвол Запытаны");
        set(hex"14", "Занадта Адкрыць / небяспечнай");
        set(hex"15", "Патрабуецца дазвол або запыту для працягу");
        set(hex"16", "Адкліканая або Banned");
        set(hex"18", "Не ўжываецца да бягучага стану");
        set(hex"1F", "Ўведзена дэталь або кіраванне Умова");

        set(hex"20", "Не знойдзена, няроўнай або па-за дыяпазону");
        set(hex"21", "Знойдзена, роўныя ці ў дыяпазоне");
        set(hex"22", "У чаканні матчу");
        set(hex"23", "Матч Запыт адпраўлены");
        set(hex"24", "Ніжэй дыяпазону або Underflow");
        set(hex"25", "Запыт на матч");
        set(hex"26", "Вышэй дыяпазон або перапаўненне");
        set(hex"28", "Дублікат, канфлікт або сутыкненне");
        set(hex"2F", "Адпаведнасць Meta або інфармацыя");

        set(hex"30", "Адпраўнік СОГЛАСЕН або Най");
        set(hex"31", "Адпраўнік згаджаецца з тым ці Yea");
        set(hex"32", "У чаканні ратыфікацыі");
        set(hex"33", "Прапанова Адпраўленыя або Прагаласавалі");
        set(hex"34", "Кворум не дасягнула");
        set(hex"35", "Ратыфікацыя прымача Запытаны");
        set(hex"36", "Прапановы, альбо Vote дасягнула мяжы");
        set(hex"38", "ужо Прагаласавалі");
        set(hex"3F", "Перагаворныя правілы ці ўдзел інфармацыя");

        set(hex"40", "недаступны");
        set(hex"41", "існуючы");
        set(hex"42", "прыпыненая");
        set(hex"43", "Queued");
        set(hex"44", "не даступная");
        set(hex"45", "У чаканні Вашага Availability");
        set(hex"46", "мінуў");
        set(hex"48", "ужо зроблена");
        set(hex"4F", "Наяўнасць правілы або інфармацыя (напр., Час з моманту або да)");

        set(hex"50", "збой перадачы");
        set(hex"51", "перанесці Паспяховая");
        set(hex"52", "У чаканні аплаты ад іншых");
        set(hex"53", "Утрыманне або Escrow");
        set(hex"54", "недахоп сродкаў");
        set(hex"55", "сродкі Запытаны");
        set(hex"56", "Перадача Аб'ём Перавышаны");
        set(hex"58", "Сродкі Не патрабуецца");
        set(hex"5F", "Токен або фінансавая інфармацыя");

        set(hex"A0", "App-Specific Failure");
        set(hex"A1", "App-Specific поспеху");
        set(hex"A2", "App-Канкрэтныя Чакаюць Іншыя");
        set(hex"A3", "App-Specific Прыёмка");
        set(hex"A4", "App-Specific Ніжэй ўмовы");
        set(hex"A5", "App-Specific прыёмнік Дзеянне Запытаны");
        set(hex"A6", "Дадатак спецыфічнасці экспирации або мяжа");
        set(hex"A8", "App-Specific неўжывальныя Стан");
        set(hex"AF", "App-Specific Meta або інфармацыя");

        set(hex"E0", "расшыфраваць Failure");
        set(hex"E1", "расшыфраваць поспех");
        set(hex"E2", "Чаканне Іншых подпісаў ці ключоў");
        set(hex"E3", "падпісаны");
        set(hex"E4", "Unsigned або ненадзейны");
        set(hex"E5", "подпіс Абавязковы");
        set(hex"E6", "Вядомы быць Аслаблены");
        set(hex"E8", "Ужо падпісаны ці не зашыфраваныя");
        set(hex"EF", "Крыптаграфія, ідэнтыфікатар або Доказ метададзеных");

        set(hex"F0", "Off-Chain Failure");
        set(hex"F1", "Off-ланцуга поспеху");
        set(hex"F2", "Чаканне па-за тэхналагічнага ланцужка");
        set(hex"F3", "Оф-ланцуга Працэс працы");
        set(hex"F4", "Off-Chain Service Недоступен");
        set(hex"F5", "Off-ланцуга Неабходныя дзеянні");
        set(hex"F6", "Off-Chain заканчэння тэрміну дзеяння або дасягнуты мяжа");
        set(hex"F8", "Дублікат Off-Chain Request");
        set(hex"FF", "Off-Chain Info або Meta");
    }
}