pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract BengaliLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "ব্যর্থতা");
        set(hex"01", "সাফল্য");
        set(hex"02", "অন্যরা প্রতীক্ষমাণ");
        set(hex"03", "গৃহীত");
        set(hex"04", "নিম্ন সীমা অথবা অপর্যাপ্ত");
        set(hex"05", "রিসিভার অ্যাকশন অনুরোধ করা");
        set(hex"06", "সর্বোচ্চ সীমা");
        set(hex"08", "নকল, Unnessesary, বা বেমানান");
        set(hex"0F", "তথ্যমূলক অথবা মেটাডাটা");

        set(hex"10", "অননুমোদিত বা বন্ধ করুন");
        set(hex"11", "অনুমোদিত বা যান");
        set(hex"12", "অন্যান্য অনুমতি প্রতীক্ষমাণ");
        set(hex"13", "অনুমতি অনুরোধ");
        set(hex"14", "খুব খোলা / অসুরক্ষিত");
        set(hex"15", "ধারাবাহিকতা জন্য আপনার অনুমতি বা অনুরোধ প্রয়োজন");
        set(hex"16", "প্রত্যাহার করা বা নিষিদ্ধ");
        set(hex"18", "বর্তমান রাজ্য জন্য প্রযোজ্য নয়");
        set(hex"1F", "অনুমতি বিবরণ অথবা নিয়ন্ত্রণ শর্তাবলী");

        set(hex"20", "খুঁজে পাওয়া যায় নি, অসম, অথবা সীমার বাইরে");
        set(hex"21", "পাওয়া, সমান বা সীমার মধ্যে");
        set(hex"22", "ম্যাচ প্রতীক্ষমাণ");
        set(hex"23", "ম্যাচ অনুরোধ পাঠানো");
        set(hex"24", "ব্যাপ্তি বা Underflow নীচে");
        set(hex"25", "ম্যাচের জন্য অনুরোধ");
        set(hex"26", "ব্যাপ্তি বা ওভারফ্লো উপরে");
        set(hex"28", "নকল, সংঘর্ষ, অথবা সংঘর্ষজনিতএকত্রিকরণ");
        set(hex"2F", "মেটা বা তথ্য সমন্বয়");

        set(hex"30", "প্রেরকের একমত বা বরং");
        set(hex"31", "প্রেরকের সম্মত বা হ্যাঁ");
        set(hex"32", "প্রতীক্ষমাণ অনুসমর্থন");
        set(hex"33", "অফার প্রেরিত বা ভোট দিয়েছেন");
        set(hex"34", "কোরাম পৌঁছে না");
        set(hex"35", "প্রাপকের অনুসমর্থন অনুরোধ করা");
        set(hex"36", "প্রস্তাব বা ভোট সীমা পৌঁছেছে");
        set(hex"38", "ইতিমধ্যে ভোট");
        set(hex"3F", "আলোচনার মাধ্যমে স্থির করা নিয়ম বা অংশগ্রহণ তথ্য");

        set(hex"40", "অপ্রাপ্য");
        set(hex"41", "সহজলভ্য");
        set(hex"42", "বিরাম দেওয়া");
        set(hex"43", "সারিবদ্ধ");
        set(hex"44", "না পাওয়া এখনো");
        set(hex"45", "আপনার প্রাপ্যতা প্রতীক্ষমাণ");
        set(hex"46", "মেয়াদোত্তীর্ণ");
        set(hex"48", "ইতিমধ্যে সম্পন্ন");
        set(hex"4F", "উপলব্ধতা নিয়ম বা তথ্য (উদাঃ যেহেতু বা না হওয়া পর্যন্ত। সময়)");

        set(hex"50", "স্থানান্তর ব্যর্থ হয়েছে");
        set(hex"51", "স্থানান্তর সফল");
        set(hex"52", "অন্যদের কাছ থেকে পেমেন্ট অপেক্ষা");
        set(hex"53", "ধরে রাখবে বা এসক্রো");
        set(hex"54", "অপর্যাপ্ত তহবিল");
        set(hex"55", "ফান্ডস অনুরোধ করা");
        set(hex"56", "ট্রান্সফার ভলিউম অতিক্রম করেছে");
        set(hex"58", "ফান্ডস প্রয়োজনীয় নয়");
        set(hex"5F", "টোকেন অথবা আর্থিক তথ্য");

        set(hex"A0", "অ্যাপ্লিকেশান-নির্দিষ্ট ব্যর্থতা");
        set(hex"A1", "অ্যাপ্লিকেশান-নির্দিষ্ট সাফল্য");
        set(hex"A2", "অ্যাপ্লিকেশান-নির্দিষ্ট প্রতীক্ষমাণ অন্যরা");
        set(hex"A3", "অ্যাপ্লিকেশান-নির্দিষ্ট স্বীকৃতি");
        set(hex"A4", "অ্যাপ্লিকেশান-নির্দিষ্ট শর্ত নীচে");
        set(hex"A5", "অ্যাপ্লিকেশান-নির্দিষ্ট রিসিভার অ্যাকশন অনুরোধ করা");
        set(hex"A6", "অ্যাপ্লিকেশান-নির্দিষ্ট মেয়াদ শেষ হওয়ার বা সীমা");
        set(hex"A8", "অ্যাপ্লিকেশান-নির্দিষ্ট অপ্রয়োগযোগ্য অবস্থা");
        set(hex"AF", "অ্যাপ্লিকেশান-নির্দিষ্ট মেটা বা তথ্য");

        set(hex"E0", "ব্যর্থতা ডিক্রিপ্ট করুন");
        set(hex"E1", "সাফল্য ডিক্রিপ্ট করুন");
        set(hex"E2", "অন্যান্য স্বাক্ষর অথবা কি-প্রতীক্ষমাণ");
        set(hex"E3", "সাইন ইন");
        set(hex"E4", "সাইন করা হয়নি বা অবিশ্বস্থ");
        set(hex"E5", "স্বাক্ষর প্রয়োজনীয়");
        set(hex"E6", "সংকটাপন্ন হিসেবে পরিচিত");
        set(hex"E8", "ইতিমধ্যে বা সাইন ইন করেননি এনক্রিপ্ট");
        set(hex"EF", "ক্রিপ্টোগ্রাফি, আইডি, বা প্রুফ মেটাডেটা");

        set(hex"F0", "অফ চেইন ব্যর্থতা");
        set(hex"F1", "অফ চেইন সাফল্য");
        set(hex"F2", "প্রতীক্ষমাণ অফ চেইন প্রক্রিয়া");
        set(hex"F3", "অফ চেইন প্রক্রিয়া শুরু");
        set(hex"F4", "অফ চেইন পরিষেবাটিতে পৌঁছানো");
        set(hex"F5", "অফ চেইন সক্রিয়তা প্রয়োজনীয়");
        set(hex"F6", "অফ চেইন মেয়াদ শেষ হওয়ার বা সীমা পৌঁছেছে");
        set(hex"F8", "সদৃশ অফ চেইন অনুরোধ");
        set(hex"FF", "অফ চেইন তথ্য বা মেটা");
    }
}