pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract BulgarianLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "неуспех");
        set(hex"01", "успех");
        set(hex"02", "Очаква Други");
        set(hex"03", "Приемани");
        set(hex"04", "По-нисък лимит или Недостатъчна");
        set(hex"05", "Приемник за действие Заявени");
        set(hex"06", "Горен лимит");
        set(hex"08", "Duplicate, Unnessesary, или неприложим");
        set(hex"0F", "Информационна или метаданни");

        set(hex"10", "Не е позволено или Стоп");
        set(hex"11", "Разрешено или Go");
        set(hex"12", "Очаква Разрешение другия");
        set(hex"13", "Иска се разрешение");
        set(hex"14", "Твърде Open / Несигурен");
        set(hex"15", "Нуждае от вашето разрешение или Искането за продължаване");
        set(hex"16", "Отменено или Забранен");
        set(hex"18", "Не е приложимо за Актуално състояние");
        set(hex"1F", "Разрешение за подробности или контролни условия");

        set(hex"20", "Не е намерена, Неравенството, или извън обхват");
        set(hex"21", "Намерено, равни или в обхват");
        set(hex"22", "Очаква мач");
        set(hex"23", "Съвпадение Заявката е изпратена");
        set(hex"24", "Под Range или долен поток");
        set(hex"25", "Искане за мач");
        set(hex"26", "Над Range или Overflow");
        set(hex"28", "Дублиране и конфликт или сблъсък");
        set(hex"2F", "Съвпадение Мета или Info");

        set(hex"30", "Подател Изразява несъгласие или Nay");
        set(hex"31", "Подател изразява съгласие или Да");
        set(hex"32", "Очаква Ратификация");
        set(hex"33", "Оферта Изпратени или Гласуваха");
        set(hex"34", "Кворум не е достигнато");
        set(hex"35", "Ратифицирането на получателя Заявени");
        set(hex"36", "Оферта или Гласувайте Достигнат е лимитът");
        set(hex"38", "вече гласува");
        set(hex"3F", "Водене на преговори Правила или Info Участие");

        set(hex"40", "Не се предлага");
        set(hex"41", "На разположение");
        set(hex"42", "Прекъснати");
        set(hex"43", "На опашка");
        set(hex"44", "Още не е налице");
        set(hex"45", "Очаква ви Наличност");
        set(hex"46", "Просрочен");
        set(hex"48", "Вече е готово");
        set(hex"4F", "Наличност Правила или информация (напр. Път от или до)");

        set(hex"50", "трансфер Неуспешно");
        set(hex"51", "Трансфер Успешното");
        set(hex"52", "Изчаква се плащане от другите");
        set(hex"53", "Задръжте или Набирателна");
        set(hex"54", "Недостатъчни средства");
        set(hex"55", "фондове Заявени");
        set(hex"56", "Прехвърляне том надвишен");
        set(hex"58", "Средствата не се изисква");
        set(hex"5F", "Token или финансова информация");

        set(hex"A0", "Неспазването на конкретно приложение");
        set(hex"A1", "Успехът на конкретно приложение");
        set(hex"A2", "Конкретно приложение Очаква Други");
        set(hex"A3", "Приемане на конкретно приложение");
        set(hex"A4", "Конкретно приложение долу Състояние");
        set(hex"A5", "Конкретно приложение приемник действие Заявени");
        set(hex"A6", "Конкретно приложение на валидност или Limit");
        set(hex"A8", "Конкретно приложение Неприложими Състояние");
        set(hex"AF", "Конкретно приложение Мета или Info");

        set(hex"E0", "Разкодирай Неспазването");
        set(hex"E1", "Разкодирай успех");
        set(hex"E2", "Очаква Други подписи или Keys");
        set(hex"E3", "подписан");
        set(hex"E4", "Неподписани или Ненадеждно");
        set(hex"E5", "Задължително подпис");
        set(hex"E6", "Известно е, че да бъде компрометирана");
        set(hex"E8", "Вече е подписан или не са шифровани");
        set(hex"EF", "Криптография, ID, или Доказателство метаданни");

        set(hex"F0", "Off-Chain Неспазването");
        set(hex"F1", "Off-Chain успех");
        set(hex"F2", "Очаква Off-Chain процес");
        set(hex"F3", "Off-Chain процес започна");
        set(hex"F4", "Off-Chain Service Недостъпна");
        set(hex"F5", "Off-Chain Необходимо действие");
        set(hex"F6", "Off-Chain Изтичане или Достигнат е лимитът");
        set(hex"F8", "Дублиране Off-Chain Искане");
        set(hex"FF", "Off-Chain Информация или Meta");
    }
}