pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract BurmeseLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "မအောင်မြင်ခြင်း");
        set(hex"01", "အောင်မြင်ခြင်း");
        set(hex"02", "အခြားသူများစောင့်ဆိုင်း");
        set(hex"03", "လက်ခံ");
        set(hex"04", "ကန့်သတ်အောက်ပိုင်းသို့မဟုတ်မလုံလောက်");
        set(hex"05", "receiver လှုပ်ရှားမှုတောင်းဆိုထားသော");
        set(hex"06", "အထက်ပိုင်းကန့်သတ်");
        set(hex"08", "မိတ္တူပွား, Unnessesary, ဒါမှမဟုတ် အသုံးပြု. မရပါ");
        set(hex"0F", "ပြန်ကြားရေးသို့မဟုတ် Metadata");

        set(hex"10", "ခွင့်ပြုသို့မဟုတ် Stop");
        set(hex"11", "Allow သို့မဟုတ် Go ကို");
        set(hex"12", "အခြားရဲ့ခွင့်ပြုချက်ကိုစောင့်ဆိုင်း");
        set(hex"13", "ခွင့်ပြုချက်တောင်းဆိုထားသော");
        set(hex"14", "လုံခြုံမှုမရှိသော / လွန်းဖွင့်ပါ");
        set(hex"15", "ဆက်လက်အတွက်သင်၏ခွင့်ပြုချက်သို့မဟုတ်တောင်းဆိုမှုလိုအပ်ပါတယ်");
        set(hex"16", "ရုတ်သိမ်းသို့မဟုတ်ပိတ်ပင်ခံရ");
        set(hex"18", "လက်ရှိပြည်နယ်မှသက်ဆိုင်သောမဟုတ်");
        set(hex"1F", "ခွင့်ပြုချက်အသေးစိတ်သို့မဟုတ်ထိန်းချုပ်ရေးအခြေအနေများ");

        set(hex"20", "တွေ့သည်မဟုတ်, မတူညီသော, ဒါမှမဟုတ်အထဲက Range");
        set(hex"21", "တွေ့သည်, Equal သို့မဟုတ် Range ထဲမှာ");
        set(hex"22", "ပွဲစဉ်စောင့်ဆိုင်း");
        set(hex"23", "Sent ပွဲစဉ်တောင်းဆိုခြင်း");
        set(hex"24", "Range သို့မဟုတ် Underflow အောက်တွင်");
        set(hex"25", "ပွဲစဉ်များအတွက်တောင်းဆိုခြင်း");
        set(hex"26", "Range သို့မဟုတ်လျှံအထက်");
        set(hex"28", "မိတ္တူပွား, ပဋိပက္ခ, ဒါမှမဟုတ် Collision");
        set(hex"2F", "ကိုက်ညီတွင် Meta သို့မဟုတ်အင်ဖို");

        set(hex"30", "ပေးပို့သူလွဲသို့မဟုတ်နေအောင်");
        set(hex"31", "ပေးပို့သူသဘောတူသို့မဟုတ်အကယ်စင်စစ်");
        set(hex"32", "သဘောတူညီချက်ရေးထိုးစောင့်ဆိုင်း");
        set(hex"33", "ကမ်းလှမ်းမှုကို Sent သို့မဟုတ်မဲပေး");
        set(hex"34", "Quorum ရောက်ရှိမ");
        set(hex"35", "receiver ရဲ့သဘောတူညီချက်ရေးထိုးတောင်းဆိုထားသော");
        set(hex"36", "ကမ်းလှမ်းမှုကိုသို့မဟုတ် Vote ကန့်သတ်ရောက်ရှိ");
        set(hex"38", "ယခုပင်လျှင်မဲပေး");
        set(hex"3F", "ညှိနှိုင်းမှုစည်းကမ်းများသို့မဟုတ်ပါဝင်လာအင်ဖို");

        set(hex"40", "မရရှိနိုင်ပါ");
        set(hex"41", "ရရှိနိုင်");
        set(hex"42", "ဆိုင်းငံ့မှု");
        set(hex"43", "တန်းစီထားသည်");
        set(hex"44", "သို့သျောလညျးရရှိနိုင်မရ");
        set(hex"45", "သင့်ရဲ့ရရှိနိုင်စောင့်ဆိုင်း");
        set(hex"46", "Expired");
        set(hex"48", "ပြီးပြီ");
        set(hex"4F", "ရရှိနိုင်စည်းကမ်းများသို့မဟုတ်အင်ဖို (ကတည်းကသို့မဟုတ်သည်အထိဟောင်း။ အချိန်)");

        set(hex"50", "လွှဲပြောင်းမှုမအောင်မြင်ပါ");
        set(hex"51", "အောင်မြင်သောလွှဲပြောင်း");
        set(hex"52", "အခြားသူများထံမှငွေပေးချေမှုရမည့်စောင့်ဆိုင်း");
        set(hex"53", "Hold သို့မဟုတ်ပွါးရေးလုပ်ငန်းနှစ်ခုကြားနေ");
        set(hex"54", "ငွေကြေးမလုံလောက်");
        set(hex"55", "တောင်းဆိုထားသောရန်ပုံငွေများ");
        set(hex"56", "လွှဲပြောင်း Volume ကိုကျော်သွားပါပြီ");
        set(hex"58", "ရန်ပုံငွေများတောင်းဆိုနေတဲ့မ");
        set(hex"5F", "တိုကင်သို့မဟုတ်ငွေကြေးဆိုင်ရာအချက်အလက်");

        set(hex"A0", "App ကို-Specific ပျက်ကွက်");
        set(hex"A1", "App ကို-Specific အောင်မြင်");
        set(hex"A2", "App ကို-Specific အခြားသူများကိုစောင့်မျှော်နေရင်း");
        set(hex"A3", "App ကို-Specific လက်ခံ");
        set(hex"A4", "အခြေအနေအောက်တွင် App ကို-Specific");
        set(hex"A5", "App ကို-Specific Receiver လှုပ်ရှားမှုတောင်းဆိုထားသော");
        set(hex"A6", "App ကို-Specific Expiry သို့မဟုတ်ကန့်သတ်");
        set(hex"A8", "App ကို-Specific အသုံးပြု. မရပါအခြေအနေ");
        set(hex"AF", "App ကို-Specific တွင် Meta သို့မဟုတ်အင်ဖို");

        set(hex"E0", "ပျက်ကွက်ခြင်း decrypt");
        set(hex"E1", "အောင်မြင်မှု decrypt");
        set(hex"E2", "အခြားလက်မှတ်သို့မဟုတ်သော့ချက်များစောင့်ဆိုင်း");
        set(hex"E3", "လက်မှတ်ရေးထိုးခဲ့");
        set(hex"E4", "လက်မှတ်မထိုးသို့မဟုတ်စိတ်မချရ");
        set(hex"E5", "လက်မှတတောင်းဆိုနေတဲ့");
        set(hex"E6", "ခိုးယူခံရဖို့လူသိများ");
        set(hex"E8", "ယခုပင်လျှင် encrypted လက်မှတ်ထိုးသို့မဟုတ်မ");
        set(hex"EF", "cryptography, ID ကို, ဒါမှမဟုတ်သက်သေပြချက် Metadata");

        set(hex"F0", "off-Chain ပျက်ကွက်");
        set(hex"F1", "off-Chain အောင်မြင်");
        set(hex"F2", "Off-Chain လုပ်ငန်းစဉ်စောင့်ဆိုင်း");
        set(hex"F3", "off-Chain လုပ်ငန်းစဉ် Started");
        set(hex"F4", "off-Chain Service ကိုလက်လှမ်းမမှီပါ");
        set(hex"F5", "off-Chain လှုပ်ရှားမှုလိုအပ်ပါသည်");
        set(hex"F6", "off-Chain Expiry သို့မဟုတ်ကန့်သတ်ရောက်ရှိ");
        set(hex"F8", "Off-Chain တောင်းဆိုခြင်း Duplicate");
        set(hex"FF", "off-Chain အင်ဖိုသို့မဟုတ် Meta");
    }
}