pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract Central KhmerLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "ការបរាជ័យ");
        set(hex"01", "ភាពជោគជ័យ");
        set(hex"02", "រង់ចាំអ្នកផ្សេងទៀត");
        set(hex"03", "បានទទួលយក");
        set(hex"04", "ដែនកំណត់ទាបឬមិនគ្រប់គ្រាន់");
        set(hex"05", "អ្នកទទួលអំពើដែលបានស្នើ");
        set(hex"06", "ដែនកំណត់ខាងលើ");
        set(hex"08", "ស្ទួន, Unnessesary ឬមិនអាចអនុវត្តបាន");
        set(hex"0F", "ផ្លូវការឬទិន្នន័យមេតា");

        set(hex"10", "មិនបានអនុញ្ញាតឬបញ្ឈប់");
        set(hex"11", "អនុញ្ញាតឬ Go");
        set(hex"12", "រង់ចាំរបស់ផ្សេងទៀតសិទ្ធិ");
        set(hex"13", "បានស្នើសិទ្ធិ");
        set(hex"14", "ការបើកចំហពេក / សុវត្ថិភាព");
        set(hex"15", "ត្រូវការសិទ្ធិឬសំណើរបស់អ្នកសម្រាប់បន្ត");
        set(hex"16", "ដកហូតឬហាម");
        set(hex"18", "មិនអនុវត្តចំពោះរដ្ឋបច្ចុប្បន្ន");
        set(hex"1F", "សេចក្ដីលម្អិតការអនុញ្ញាតឬលក្ខខណ្ឌត្រួតពិនិត្យការ");

        set(hex"20", "រកមិនឃើញ, មិនស្មើភាពឬចេញពីជួរ");
        set(hex"21", "បានរកឃើញនៅក្នុងជួរស្មើឬ");
        set(hex"22", "រង់ចាំការផ្គូផ្គង");
        set(hex"23", "ការប្រកួតផ្ញើសំណើរ");
        set(hex"24", "ខាងក្រោមជួរឬខ្វះ");
        set(hex"25", "សំណើសម្រាប់ការប្រកួត");
        set(hex"26", "នៅខាងលើជួរឬលើសចំណុះ");
        set(hex"28", "ស្ទួន, ជម្លោះ, ឬការប៉ះទង្គិចគ្នា");
        set(hex"2F", "ការផ្គូផ្គងមេតាឬព័តមាន");

        set(hex"30", "disagreeable អ្នកផ្ញើឬណៃ");
        set(hex"31", "អ្នកផ្ញើយល់ព្រមឬមែនហើយ");
        set(hex"32", "ការផ្ដល់សច្ចាប័នរង់ចាំ");
        set(hex"33", "ការផ្តល់ជូនផ្ញើឬបោះឆ្នោត");
        set(hex"34", "កូរ៉ុមមិនបានឈានដល់");
        set(hex"35", "ការផ្ដល់សច្ចាប័នរបស់អ្នកទទួលបានស្នើ");
        set(hex"36", "ការផ្តល់ជូនឬការកំណត់ដល់ការបោះឆ្នោត");
        set(hex"38", "បោះឆ្នោតរួចទៅហើយ");
        set(hex"3F", "ច្បាប់ការចរចាឬព័តចូលរួម");

        set(hex"40", "មិនអាចប្រើបាន");
        set(hex"41", "ដែលអាចប្រើបាន");
        set(hex"42", "ផ្អាក");
        set(hex"43", "ដាក់ជាជួរ");
        set(hex"44", "មិនមាននៅឡើយទេ");
        set(hex"45", "រង់ចាំការមានរបស់អ្នក");
        set(hex"46", "ផុតកំណត់");
        set(hex"48", "ធ្វើរួចទៅហើយ");
        set(hex"4F", "ច្បាប់អាចប្រើបានឬព័តមាន (អតីតពេលវេលា។ ចាប់តាំងពីឬរហូតដល់)");

        set(hex"50", "ផ្ទេរបានបរាជ័យ");
        set(hex"51", "ផ្ទេរជោគជ័យ");
        set(hex"52", "រង់ចាំការទូទាត់ពីអ្នកផ្សេងទៀត");
        set(hex"53", "សង្កត់ឬ escrow");
        set(hex"54", "មូលនិធិមិនគ្រប់គ្រាន់");
        set(hex"55", "មូលនិធិដែលបានស្នើ");
        set(hex"56", "កម្រិតសំឡេងលើសពីផ្ទេរ");
        set(hex"58", "មូលនិធិមិនត្រូវការ");
        set(hex"5F", "សញ្ញាសម្ងាត់ឬហិរញ្ញវត្ថុព");

        set(hex"A0", "ការបរាជ័យកម្មវិធីជាក់លាក់");
        set(hex"A1", "ជោគជ័យកម្មវិធីជាក់លាក់");
        set(hex"A2", "កម្មវិធីជាក់លាក់រង់ចាំអ្នកផ្សេងទៀត");
        set(hex"A3", "ការទទួលយកកម្មវិធីជាក់លាក់");
        set(hex"A4", "កម្មវិធីជាក់លាក់ខាងក្រោមលក្ខខណ្ឌ");
        set(hex"A5", "កម្មវិធីជាក់លាក់សកម្មភាពទទួលបានស្នើ");
        set(hex"A6", "កម្មវិធីជាក់លាក់ផុតកំណត់ឬដែនកំណត់");
        set(hex"A8", "លក្ខខណ្ឌអាចអនុវត្តកម្មវិធីជាក់លាក់");
        set(hex"AF", "កម្មវិធីជាក់លាក់មេតាឬព័តមាន");

        set(hex"E0", "ឌិគ្រីបការបរាជ័យ");
        set(hex"E1", "ឌិគ្រីបជោគជ័យ");
        set(hex"E2", "រង់ចាំហត្ថលេខាឬគ្រាប់ចុចផ្សេងទៀត");
        set(hex"E3", "បាន​ចុះហត្ថលេខា​លើ");
        set(hex"E4", "មិនបានចុះហត្ថលេខាឬមិនជឿទុកចិត្ត");
        set(hex"E5", "ហត្ថលេខាត្រូវការ");
        set(hex"E6", "គេស្គាល់ថាជាត្រូវបានរំខាន");
        set(hex"E8", "បានចុះហត្ថលេខារួចហើយឬមិនបានអ៊ិនគ្រីប");
        set(hex"EF", "ការគ្រីប, លេខសម្គាល់ឬទិន្នន័យមេតាភស្តុតាង");

        set(hex"F0", "បិទខ្សែសង្វាក់ការបរាជ័យ");
        set(hex"F1", "បិទខ្សែសង្វាក់ភាពជោគជ័យ");
        set(hex"F2", "កំពុងរង់ចាំការបិទខ្សែសង្វាក់ដំណើរការ");
        set(hex"F3", "ដំណើរការខ្សែសង្វាក់បានចាប់ផ្តើមបិទ");
        set(hex"F4", "បិទសេវាទៅដល់ខ្សែសង្វាក់");
        set(hex"F5", "បិទខ្សែសង្វាក់សកម្មភាពដែលត្រូវការ");
        set(hex"F6", "បិទផុតកំណត់ឬដែនកំណត់សង្វាក់ឈានដល់");
        set(hex"F8", "ស្ទួនខ្សែសង្វាក់សំណើបិទ");
        set(hex"FF", "បិទខ្សែសង្វាក់ Info ឬមេតា");
    }
}