pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract GujaratiLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "નિષ્ફળતા");
        set(hex"01", "સફળતા");
        set(hex"02", "અન્ય પ્રતીક્ષામાં");
        set(hex"03", "સ્વીકારાયું");
        set(hex"04", "નીચલી મર્યાદા અથવા અપર્યાપ્ત");
        set(hex"05", "રીસીવર ક્રિયાની વિનંતી કરી");
        set(hex"06", "મહત્તમ મર્યાદા");
        set(hex"08", "ડુપ્લિકેટ, Unnessesary, અથવા લાગુ ન પડતી");
        set(hex"0F", "માહિતીપૂર્ણ અથવા મેટાડેટા");

        set(hex"10", "અમાન્ય અથવા રોકો");
        set(hex"11", "મંજૂર અથવા જવા");
        set(hex"12", "અન્ય પરવાનગી પ્રતીક્ષામાં");
        set(hex"13", "પરવાનગીની વિનંતી કરી");
        set(hex"14", "ખૂબ ખોલો / અસુરક્ષિત");
        set(hex"15", "ચાલુ રાખવા માટે તમારી પરવાનગીની અથવા વિનંતી જરૂરત");
        set(hex"16", "રદ અથવા પ્રતિબંધિત");
        set(hex"18", "વર્તમાન રાજ્ય પર લાગુ નથી");
        set(hex"1F", "પરવાનગી વિગતો અથવા નિયંત્રણ શરતો");

        set(hex"20", "મળ્યું નથી, અનઇક્વલ, અથવા શ્રેણી બહાર");
        set(hex"21", "જોવા મળે છે, સમાન અથવા શ્રેણીમાં");
        set(hex"22", "મેળ પ્રતીક્ષામાં");
        set(hex"23", "મેળ વિનંતી મોકલી");
        set(hex"24", "શ્રેણી અથવા Underflow નીચે");
        set(hex"25", "મેચ માટે વિનંતી");
        set(hex"26", "શ્રેણી અથવા ઓવરફ્લો ઉપર");
        set(hex"28", "ડુપ્લિકેટ, કોન્ફલિક્ટ, અથવા અથડામણ");
        set(hex"2F", "મેટા અથવા માહિતી મેળ");

        set(hex"30", "પ્રેષક અસંમત અથવા નાયનું");
        set(hex"31", "પ્રેષક સંમત અથવા હા");
        set(hex"32", "પ્રતીક્ષામાં કરાયો");
        set(hex"33", "ઓફર કરવામાં કે મોકલવામાં વરણી");
        set(hex"34", "કોરમ પહોંચી");
        set(hex"35", "રીસીવર માતાનો કરાયો વિનંતી");
        set(hex"36", "ઓફર અથવા વોટ સીમા સમાપ્ત");
        set(hex"38", "પહેલાથી મત આપેલો");
        set(hex"3F", "નેગોશીયેશન નિયમો અથવા ભાગીદારી માહિતી");

        set(hex"40", "અનુપલબ્ધ");
        set(hex"41", "ઉપલબ્ધ");
        set(hex"42", "થોભાવેલું");
        set(hex"43", "કતારબદ્ધ");
        set(hex"44", "હજી સુધી ઉપલબ્ધ નથી");
        set(hex"45", "તમારી ઉપલબ્ધતા પ્રતીક્ષામાં");
        set(hex"46", "સમય સમાપ્ત થયો છે");
        set(hex"48", "ક્યારનું કરી દીધું");
        set(hex"4F", "ઉપલબ્ધતા નિયમો અથવા માહિતી (ઉદા ત્યારથી અથવા ત્યાં સુધી. સમય)");

        set(hex"50", "સ્થાનાંતરણ નિષ્ફળ થયું");
        set(hex"51", "ટ્રાન્સફર સફળ");
        set(hex"52", "અન્ય લોકો પાસેથી ચુકવણી પ્રતીક્ષામાં");
        set(hex"53", "પકડો અથવા એસ્ક્રો");
        set(hex"54", "અપૂરતું ભંડોળ");
        set(hex"55", "ફંડ વિનંતી");
        set(hex"56", "ટ્રાન્સફર વોલ્યુમ ઓળંગાઈ");
        set(hex"58", "ફંડ જરૂરી નથી");
        set(hex"5F", "ટોકન અથવા નાણાંકીય માહિતી");

        set(hex"A0", "એપ્લિકેશન-વિશિષ્ટ નિષ્ફળતા");
        set(hex"A1", "એપ્લિકેશન-વિશિષ્ટ સફળતા");
        set(hex"A2", "એપ્લિકેશન-વિશિષ્ટ પ્રતીક્ષામાં અન્ય");
        set(hex"A3", "એપ્લિકેશન-વિશિષ્ટ સ્વીકૃતિ");
        set(hex"A4", "એપ્લિકેશન-વિશિષ્ટ કન્ડિશન નીચે");
        set(hex"A5", "એપ્લિકેશન-વિશિષ્ટ રીસીવર ક્રિયાની વિનંતી કરી");
        set(hex"A6", "એપ્લિકેશન-વિશિષ્ટ સમય સમાપ્તિ અથવા મર્યાદા");
        set(hex"A8", "એપ્લિકેશન-વિશિષ્ટ લાગુ ન પડતી કન્ડિશન");
        set(hex"AF", "એપ્લિકેશન-વિશિષ્ટ મેટા અથવા માહિતી");

        set(hex"E0", "નિષ્ફળતા ડિક્રિપ્ટ");
        set(hex"E1", "સફળતા ડિક્રિપ્ટ");
        set(hex"E2", "અન્ય સિગ્નેચર્સ અથવા કી પ્રતીક્ષામાં");
        set(hex"E3", "સાઇન ઇન કરો");
        set(hex"E4", "બિનહસ્તાક્ષરિત અથવા અવિશ્વસનીય");
        set(hex"E5", "હસ્તાક્ષર જરૂરી");
        set(hex"E6", "શંકાસ્પદ હોવાનું જાણીતું");
        set(hex"E8", "પહેલાંથી સાઇન ઇન નથી એન્ક્રિપ્ટેડ");
        set(hex"EF", "ક્રિપ્ટોગ્રાફી, ID, અથવા પુરાવો મેટાડેટા");

        set(hex"F0", "બંધ-ચેઇન નિષ્ફળતા");
        set(hex"F1", "બંધ-ચેઇન સફળતા");
        set(hex"F2", "પ્રતીક્ષામાં બંધ-ચેઇન પ્રક્રિયા");
        set(hex"F3", "બંધ-ચેઇન પ્રક્રિયા શરૂ");
        set(hex"F4", "બંધ-ચેઇન સેવા સુધી પહોંચી શકાતું");
        set(hex"F5", "બંધ-ચેઇન ક્રિયા આવશ્યક");
        set(hex"F6", "બંધ-ચેઇન સમય સમાપ્તિ અથવા સીમા સમાપ્ત");
        set(hex"F8", "ડુપ્લિકેટ બંધ-ચેઇન વિનંતી");
        set(hex"FF", "બંધ-ચેઇન માહિતી અથવા મેટા");
    }
}