pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract HebrewLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "כישלון");
        set(hex"01", "הצלחה");
        set(hex"02", "ממתין אחר");
        set(hex"03", "Accepted");
        set(hex"04", "גבול תחתון או לא מספיק");
        set(hex"05", "המתבקשת כונס פעולה");
        set(hex"06", "גבול עליון");
        set(hex"08", "שכפל, Unnessesary, או בלתי ישים");
        set(hex"0F", "הסברה או Metadata");

        set(hex"10", "לחסום או לא תפסיק");
        set(hex"11", "מותרים או לכו");
        set(hex"12", "ממתין אישורו של הצד האחר");
        set(hex"13", "בקשה לאישור");
        set(hex"14", "Open מדי / לא בטוח");
        set(hex"15", "זקוק לאישור או בקשתך לקבלת המשך");
        set(hex"16", "בוטל או מגורש");
        set(hex"18", "אינו חל על מדינה נוכחית");
        set(hex"1F", "פרטי הרשאה או תנאי בקרה");

        set(hex"20", "לא נמצא, שוויוני, או מחוץ לטווח");
        set(hex"21", "נמצא, שוויון או בטווח");
        set(hex"22", "ממתין התאמה");
        set(hex"23", "התאמת בקשה נשלחה");
        set(hex"24", "להלן טווח או underflow");
        set(hex"25", "בקשת התאמה");
        set(hex"26", "מעל הטווח או גלישה");
        set(hex"28", "שכפל, קונפליקט, או התנגשות");
        set(hex"2F", "התאמת Meta או מידע");

        set(hex"30", "חולק סנדר או לאו");
        set(hex"31", "סנדר מסכים או Yea");
        set(hex"32", "אשרור ממתין");
        set(hex"33", "Sent הצעה או הצביע");
        set(hex"34", "Quorum לא הגיע");
        set(hex"35", "האשרור של הכונס המתבקש");
        set(hex"36", "הגבל הצעה או להצביע הגיע");
        set(hex"38", "כבר הצביע");
        set(hex"3F", "כללי משא ומתן או מידע השתתפות");

        set(hex"40", "אינו זמין");
        set(hex"41", "זמין");
        set(hex"42", "מושהה");
        set(hex"43", "בתור עכשיו");
        set(hex"44", "עדיין לא זמין");
        set(hex"45", "ממתין הזמינות שלך");
        set(hex"46", "לא בתוקף");
        set(hex"48", "כבר נעשה");
        set(hex"4F", "כללים זמינים או מידע (לשעבר. זמן מאז או עד)");

        set(hex"50", "העברה נכשלה");
        set(hex"51", "ההעברה בוצעה בהצלחה");
        set(hex"52", "תשלום ממתין מאחרים");
        set(hex"53", "חזק או בפקדון");
        set(hex"54", "אין מספיק כספים");
        set(hex"55", "מימון מבוקש");
        set(hex"56", "העברת חריגת נפח");
        set(hex"58", "קרנות לא חובה");
        set(hex"5F", "מידע אסימון או פיננסי");

        set(hex"A0", "אי ספציפית לאפליקציה");
        set(hex"A1", "הצלחה ספציפית לאפליקציה");
        set(hex"A2", "ספציפית לאפליקציה אחרת הממתינות");
        set(hex"A3", "קבלה ספציפית לאפליקציה");
        set(hex"A4", "ספציפית לאפליקציה להלן מצב");
        set(hex"A5", "ספציפית לאפליקציה פעולה כונס המתבקשת");
        set(hex"A6", "ספציפית לאפליקציה תפוגה או הגבל");
        set(hex"A8", "ספציפית לאפליקצית מצב שאינו מתאים");
        set(hex"AF", "ספציפית לאפליקציה Meta או מידע");

        set(hex"E0", "פענח אי");
        set(hex"E1", "פענח הצלחה");
        set(hex"E2", "ממתין חתימות אחרות או מפתחות");
        set(hex"E3", "חתם");
        set(hex"E4", "לא חתום או לא מהימן");
        set(hex"E5", "חתימה נדרשת");
        set(hex"E6", "ידוע שהוא נפרץ");
        set(hex"E8", "כבר חתום או לא מוצפן");
        set(hex"EF", "קריפטוגרפיה, מזהה, או מידע נוסף על הוכחת");

        set(hex"F0", "Off-שרשרת אי");
        set(hex"F1", "Off-שרשרת הצלחה");
        set(hex"F2", "ממתין מחוץ שרשרת תהליכים");
        set(hex"F3", "תהליך Off-שרשרת Started");
        set(hex"F4", "Off-שרשרת שירות לא ניתן לגישה");
        set(hex"F5", "Off-שרשרת הפעולה הנדרשת");
        set(hex"F6", "Off-שרשרת תפוגה או הגיע לגבול");
        set(hex"F8", "שכפל Off-שרשרת בקשה");
        set(hex"FF", "Off-שרשרת מידע או מטה");
    }
}