pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract KannadaLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "ವೈಫಲ್ಯ");
        set(hex"01", "ಯಶಸ್ಸು");
        set(hex"02", "ಇತರೆ ನಿರೀಕ್ಷಿಸಲಾಗುತ್ತಿದೆ");
        set(hex"03", "ಅಕ್ಸೆಪ್ಟೆಡ್");
        set(hex"04", "ಲೋವರ್ ಮಿತಿ ಅಥವಾ ಸಾಕಷ್ಟಿಲ್ಲದ");
        set(hex"05", "ಸ್ವೀಕರಿಸುವವರ ಕ್ರಿಯೆ ವಿನಂತಿಸಲಾಗಿದೆ");
        set(hex"06", "ಗರಿಷ್ಠ ಮಟ್ಟ");
        set(hex"08", "ನಕಲು, Unnessesary, ಅಥವಾ ಅನ್ವಯವಾಗದ");
        set(hex"0F", "ಮಾಹಿತಿಯುಳ್ಳ ಅಥವಾ ಮೆಟಾಡೇಟಾ");

        set(hex"10", "ನಿರ್ಬಂಧಿಸಿದ ಅಥವಾ ನಿಲ್ಲಿಸಿ");
        set(hex"11", "ಅನುಮತಿಸಲಾದ ಅಥವಾ ಹೋಗಿ");
        set(hex"12", "ಬೇರೆಯದರ ಅನುಮತಿ ನಿರೀಕ್ಷಿಸಲಾಗುತ್ತಿದೆ");
        set(hex"13", "ಅನುಮತಿ ವಿನಂತಿಸಲಾಗಿದೆ");
        set(hex"14", "ಟೂ ತೆರೆಯಿರಿ / ಅಭದ್ರ");
        set(hex"15", "ಮುಂದುವರಿಕೆ ನಿಮ್ಮ ಅನುಮತಿ ಅಥವಾ ವಿನಂತಿ ನೀಡ್ಸ್");
        set(hex"16", "ಮರುಪಡೆಯಲಾಗಿದೆ ಅಥವಾ ನಿಷೇಧಿಸಲಾಗಿದೆ");
        set(hex"18", "ಕರೆಂಟ್ ಸ್ಟೇಟ್ ಗೆ ಅನ್ವಯಿಸುವುದಿಲ್ಲ");
        set(hex"1F", "ಅನುಮತಿ ವಿವರಗಳು ಅಥವಾ ಕಂಟ್ರೋಲ್ ನಿಯಮಗಳು");

        set(hex"20", ", ಯುನಿಕಲ್ ಕಂಡು, ಅಥವಾ ಔಟ್ ಶ್ರೇಣಿಯ ಮಾಡಿಲ್ಲ");
        set(hex"21", "ಫೌಂಡ್, ಸಮಾನ ಅಥವಾ ಶ್ರೇಣಿಯಲ್ಲಿ");
        set(hex"22", "ಹೊಂದಿಕೆ ನಿರೀಕ್ಷಿಸಲಾಗುತ್ತಿದೆ");
        set(hex"23", "ಹೊಂದಿಕೆ ಕೋರಿಕೆಯನ್ನು ಕಳುಹಿಸಲಾಗಿದೆ");
        set(hex"24", "ರೇಂಜ್ ಅಥವಾ ಗುಪ್ತವಾಹಿನಿ ಕೆಳಗೆ");
        set(hex"25", "ಹೊಂದಿಕೆ ವಿನಂತಿ");
        set(hex"26", "ರೇಂಜ್ ಅಥವಾ ಹೆಚ್ಚುವರಿ ಮೇಲೆ");
        set(hex"28", "ನಕಲು, ಕಾನ್ಫ್ಲಿಕ್ಟ್, ಅಥವಾ ಸಂಘರ್ಷ");
        set(hex"2F", "ಮೆಟಾ ಅಥವಾ ಮಾಹಿತಿ ಹೊಂದಾಣಿಕೆಯ");

        set(hex"30", "ಕಳುಹಿಸಿದವರ ಒಪ್ಪುವುದಿಲ್ಲ ಅಥವಾ ನೇಯ್");
        set(hex"31", "ಕಳುಹಿಸಿದವರ ಸಮ್ಮತಿಸುತ್ತದೆ ಅಥವಾ ಹೌದು");
        set(hex"32", "ನಿರೀಕ್ಷಿಸಲಾಗುತ್ತಿದೆ ಊರ್ಜಿತಗೊಳಿಸುವ");
        set(hex"33", "ಆಫರ್ ಸೆಂಟ್ ಆರ್ ಮತ");
        set(hex"34", "ಕ್ವೊರಮ್ ತಲುಪಿದೆ ಮಾಡಿಲ್ಲ");
        set(hex"35", "ರಿಸೀವರ್ನ ಊರ್ಜಿತಗೊಳಿಸುವ ವಿನಂತಿಸಲಾಗಿದೆ");
        set(hex"36", "ಆಫರ್ ಅಥವಾ ವೋಟ್ ಮಿತಿ ತಲುಪಿದೆ");
        set(hex"38", "ಈಗಾಗಲೇ ಮತ");
        set(hex"3F", "ನೆಗೋಷಿಯೇಶನ್ ನಿಯಮಗಳು ಅಥವಾ ಭಾಗವಹಿಸುವಿಕೆ ಮಾಹಿತಿ");

        set(hex"40", "ಲಭ್ಯವಿಲ್ಲ");
        set(hex"41", "ಲಭ್ಯವಿರುವ");
        set(hex"42", "ತಾತ್ಕಾಲಿಕವಾಗಿ ವಿರಾಮ");
        set(hex"43", "ಸರದಿಯಲ್ಲಿರುವ");
        set(hex"44", "ಇನ್ನೂ ಲಭ್ಯವಿಲ್ಲ");
        set(hex"45", "ನಿಮ್ಮ ಲಭ್ಯತೆ ನಿರೀಕ್ಷಿಸಲಾಗುತ್ತಿದೆ");
        set(hex"46", "ಅವಧಿ");
        set(hex"48", "ಆಗಲೇ ಮಾಡಾಗಿದೆ");
        set(hex"4F", "ಲಭ್ಯತೆ ನಿಯಮಗಳು ಅಥವಾ ಮಾಹಿತಿ (ಉದಾ. ರಿಂದ ಅಥವಾ ರವರೆಗೆ ಸಮಯ)");

        set(hex"50", "ಟ್ರಾನ್ಸ್ಫರ್ ವಿಫಲವಾಗಿದೆ");
        set(hex"51", "ಯಶಸ್ವಿ ವರ್ಗಾಯಿಸಿ");
        set(hex"52", "ಇತರೆ ಗೆ ಪಾವತಿ ನಿರೀಕ್ಷಿಸಲಾಗುತ್ತಿದೆ");
        set(hex"53", "ಹೋಲ್ಡ್ ಅಥವಾ ಭರವಸೆಯ");
        set(hex"54", "ಹಣದ ಕೊರತೆ ಇದೆ");
        set(hex"55", "ಫಂಡ್ಸ್ ವಿನಂತಿಸಲಾಗಿದೆ");
        set(hex"56", "ಟ್ರಾನ್ಸ್ಫರ್ ಸಂಪುಟ ಮಿತಿಮೀರಿದೆ");
        set(hex"58", "ಫಂಡ್ಸ್ ಅಗತ್ಯವಿಲ್ಲ");
        set(hex"5F", "ಟೋಕನ್ ಅಥವಾ ಹಣಕಾಸು ಮಾಹಿತಿ");

        set(hex"A0", "ಅಪ್ಲಿಕೇಶನ್ ನಿರ್ದಿಷ್ಟ ವೈಫಲ್ಯ");
        set(hex"A1", "ಅಪ್ಲಿಕೇಶನ್ ನಿರ್ದಿಷ್ಟ ಯಶಸ್ಸು");
        set(hex"A2", "ಅಪ್ಲಿಕೇಶನ್ ನಿರ್ದಿಷ್ಟ ನಿರೀಕ್ಷಿಸಲಾಗುತ್ತಿದೆ ಇತರೆ");
        set(hex"A3", "ಅಪ್ಲಿಕೇಶನ್ ನಿರ್ದಿಷ್ಟ ಅಂಗೀಕಾರ");
        set(hex"A4", "ಕಂಡಿಶನ್ ಕೆಳಗೆ ಅಪ್ಲಿಕೇಶನ್ ನಿರ್ದಿಷ್ಟ");
        set(hex"A5", "ಅಪ್ಲಿಕೇಶನ್ ನಿರ್ದಿಷ್ಟ ಸ್ವೀಕರಿಸುವವರ ಕ್ರಿಯೆ ವಿನಂತಿಸಲಾಗಿದೆ");
        set(hex"A6", "ಅಪ್ಲಿಕೇಶನ್ ನಿರ್ದಿಷ್ಟ ಅವಧಿ ಮುಗಿಯುವ ಅಥವಾ ಮಿತಿ");
        set(hex"A8", "ಅಪ್ಲಿಕೇಶನ್ ನಿರ್ದಿಷ್ಟ ಅನ್ವಯವಾಗದ ಕಂಡಿಶನ್");
        set(hex"AF", "ಅಪ್ಲಿಕೇಶನ್ ನಿರ್ದಿಷ್ಟ ಮೆಟಾ ಅಥವಾ ಮಾಹಿತಿ");

        set(hex"E0", "ವೈಫಲ್ಯ ಡೀಕ್ರಿಪ್ಟ್");
        set(hex"E1", "ಯಶಸ್ಸು ಡೀಕ್ರಿಪ್ಟ್");
        set(hex"E2", "ಇತರೆ ಸಹಿಗಳು ಅಥವಾ ಕೀಸ್ ನಿರೀಕ್ಷಿಸಲಾಗುತ್ತಿದೆ");
        set(hex"E3", "ಸಹಿ");
        set(hex"E4", "ರುಜುಮಾಡದ ಅಥವಾ ನಂಬಿಕೆರಹಿತ");
        set(hex"E5", "ಸಹಿ ಅಗತ್ಯ");
        set(hex"E6", "ಧಕ್ಕೆಯಾಗಿದೆ ಎನ್ನಲಾಗಿದೆ");
        set(hex"E8", "ಈಗಾಗಲೇ ಸಹಿ ಹಾಕಿರುವುದು ಅಥವಾ ಎನ್ಕ್ರಿಪ್ಟ್");
        set(hex"EF", "ಕ್ರಿಪ್ಟೋಗ್ರಫಿ, ID, ಅಥವಾ ಪುರಾವೆ ಮೆಟಾಡೇಟಾ");

        set(hex"F0", "ಆಫ್-ಚೈನ್ ವೈಫಲ್ಯ");
        set(hex"F1", "ಆಫ್-ಚೈನ್ ಯಶಸ್ಸು");
        set(hex"F2", "ನಿರೀಕ್ಷಿಸಲಾಗುತ್ತಿದೆ ಆಫ್-ಚೈನ್ ಪ್ರಕ್ರಿಯೆ");
        set(hex"F3", "ಆಫ್-ಚೈನ್ ಪ್ರಕ್ರಿಯೆ ಆರಂಭಗೊಂಡ");
        set(hex"F4", "ಆಫ್-ಚೈನ್ ಸೇವೆ ತಲುಪಲು ಸಾಧ್ಯವಾಗದ");
        set(hex"F5", "ಆಫ್-ಚೈನ್ ಕ್ರಿಯೆ ಅಗತ್ಯವಿದೆ");
        set(hex"F6", "ಆಫ್-ಚೈನ್ ಅವಧಿ ಮುಗಿಯುವ ಅಥವಾ ಮಿತಿ ತಲುಪಿದೆ");
        set(hex"F8", "ನಕಲು ಆಫ್-ಚೈನ್ ವಿನಂತಿ");
        set(hex"FF", "ಆಫ್-ಚೈನ್ ಮಾಹಿತಿ ಅಥವಾ ಮೆಟಾ");
    }
}