pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract KazakhLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "сәтсіздік");
        set(hex"01", "Жетістік");
        set(hex"02", "Басқаларды күтуде");
        set(hex"03", "қабылданған");
        set(hex"04", "Limit Төменгі немесе жеткіліксіз");
        set(hex"05", "Қабылдағыш Action Сұралған");
        set(hex"06", "жоғарғы шегі");
        set(hex"08", "Қайталанатын, Unnessesary немесе Қолданылмайтын");
        set(hex"0F", "Ақпараттық немесе Метадеректер");

        set(hex"10", "Тыйым немесе Стоп");
        set(hex"11", "Рұқсат етілген немесе Go");
        set(hex"12", "Өзгенің рұқсатымен күтіп");
        set(hex"13", "рұқсат Сұралған");
        set(hex"14", "Қорғалмаған / Тым Ашық");
        set(hex"15", "Жалғастыру үшін, сізден рұқсат немесе сұрау қажет");
        set(hex"16", "Қайтарылып немесе тыйым салынған");
        set(hex"18", "Ағымдағы мемлекетке қатысты емес");
        set(hex"1F", "Рұқсат Толығырақ немесе бақылау шарттары");

        set(hex"20", "Табылған жоқ, тең емес, немесе Out ауқымы");
        set(hex"21", "Табылған, Тең немесе ауқымында");
        set(hex"22", "Match күтіп");
        set(hex"23", "Жіберілген Match сұрау");
        set(hex"24", "Ауқымдағы немесе термеген Төменде");
        set(hex"25", "Match сұрау");
        set(hex"26", "Ауқымдағы немесе толып жоғарыда");
        set(hex"28", "Қайталанатын, қақтығыс немесе соқтығысу");
        set(hex"2F", "Matching Meta немесе Info");

        set(hex"30", "Жіберуші келіспесе не Жоқ");
        set(hex"31", "Жіберуші келісемін немесе Иә");
        set(hex"32", "Ратификациялау күтіп");
        set(hex"33", "Ұсыныс Жіберілген немесе Дауыс");
        set(hex"34", "Кворумға қол жеткізілмеген");
        set(hex"35", "Ресивердің Ратификациялау Сұралған");
        set(hex"36", "Ұсыныс немесе дауыс шегіне жетті");
        set(hex"38", "қазірдің өзінде Дауыс");
        set(hex"3F", "Келіссөздер Ережелер немесе қатысу Info");

        set(hex"40", "қолжетімсіз");
        set(hex"41", "Қол жетімді");
        set(hex"42", "кідіртілген");
        set(hex"43", "Кезектегі");
        set(hex"44", "Әлі қол жетімді емес");
        set(hex"45", "Сіздің жетімділік күтіп");
        set(hex"46", "Жарамдылық мерзімі өткен");
        set(hex"48", "қазірдің өзінде Done");
        set(hex"4F", "Болуы ережелері немесе Info (бері немесе дейін экс. Уақыты)");

        set(hex"50", "Transfer орындалмады");
        set(hex"51", "табысты Transfer");
        set(hex"52", "Өзгелерден төлеу күтіп");
        set(hex"53", "Ұстаңыз немесе Эскроу");
        set(hex"54", "жеткіліксіз қорлар");
        set(hex"55", "Сұралған қаражат");
        set(hex"56", "Transfer көлемінен асып");
        set(hex"58", "Қаражат Қажетті емес,");
        set(hex"5F", "Төкен немесе қаржылық ақпарат");

        set(hex"A0", "Қолданба орындамау");
        set(hex"A1", "Қолданба Success");
        set(hex"A2", "Қолданба Басқаларды күтілуде");
        set(hex"A3", "Қолданба қабылдау");
        set(hex"A4", "Жағдайы Төменде бағдарлама арнайы");
        set(hex"A5", "Қолданба Қабылдағыш Action Сұралған");
        set(hex"A6", "Қолданба Бітетін немесе шектеу");
        set(hex"A8", "Қолданба Қолданылмайтын жағдайы");
        set(hex"AF", "Қолданба Meta немесе Info");

        set(hex"E0", "Ошибка шифрын");
        set(hex"E1", "табыс шифрын");
        set(hex"E2", "Басқа Қолтаңбалар немесе пернелерді күтіп");
        set(hex"E3", "қол");
        set(hex"E4", "Қойылмаған немесе сенімсіз");
        set(hex"E5", "қол қою талап");
        set(hex"E6", "Ымыраға келу үшін белгілі");
        set(hex"E8", "Қазірдің өзінде Шифрланған қол қойған немесе емес,");
        set(hex"EF", "Криптография, ID немесе Proof Metadata");

        set(hex"F0", "Off-Chain орындамау");
        set(hex"F1", "Off-Chain Success");
        set(hex"F2", "Off-тізбекті процесін күтіп");
        set(hex"F3", "Off-Chain процесі басталды");
        set(hex"F4", "Off тізбекті қызметі Жетпейтін");
        set(hex"F5", "Off-Chain Action Міндетті");
        set(hex"F6", "Off-Chain Бітетін немесе шегіне жетті");
        set(hex"F8", "Off-Chain өтінішке қайталайтын");
        set(hex"FF", "Off-Chain Info немесе Meta");
    }
}