pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract Kirghiz, KyrgyzLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "бузуу");
        set(hex"01", "ийгилик");
        set(hex"02", "күтүп Башкаларга");
        set(hex"03", "кабыл алынган");
        set(hex"04", "Төмөнкү Limit же жетишсиз");
        set(hex"05", "Алуучу Action суралды");
        set(hex"06", "Жогорку Limit");
        set(hex"08", "Көчүрмө, Unnessesary, же Колдонулбаган");
        set(hex"0F", "Маалымат же Metadata");

        set(hex"10", "Уруксат берилбеген же токтотуу");
        set(hex"11", "Уруксат же Мурунку");
        set(hex"12", "Күтүп башка түрү уруксаты");
        set(hex"13", "уруксат суралды");
        set(hex"14", "Тоо Open / кооптуу");
        set(hex"15", "Колдоо үчүн уруксат же арызда муктаж");
        set(hex"16", "Жокко чыгарылган же тыюу салынды");
        set(hex"18", "Учурдагы мамлекетке карата колдонулуучу жок");
        set(hex"1F", "Уруксат маалыматтар же Control шарттары");

        set(hex"20", "Табылган жок, ар кандай, же тоо кыркасынын Out");
        set(hex"21", "Found, Бирдей же кырка-жылы");
        set(hex"22", "күтүп оюну");
        set(hex"23", "Дал өтүнүч жөнөттү");
        set(hex"24", "Төмөндө кыркасынын же Underflow");
        set(hex"25", "Дал келтирүү жөнүндө өтүнүч кат");
        set(hex"26", "Жогоруда кыркасынын же ашып");
        set(hex"28", "Көчүрмө, чыр-чатак, же Collision");
        set(hex"2F", "Дал Meta же Info");

        set(hex"30", "Жөнөтүүчүнүн макул же Жок");
        set(hex"31", "Жөнөтүүчүнүн макул же Ооба");
        set(hex"32", "күтүп Айбек");
        set(hex"33", "Сунуш жөнөтүлдү же драма");
        set(hex"34", "Нисабга жеткен эмес,");
        set(hex"35", "Алуучунун Айбек Суралган");
        set(hex"36", "Сунуш же Добуш чегине жетти");
        set(hex"38", "добуш");
        set(hex"3F", "Сүйлөшүүлөр Эреже же катышуу Info");

        set(hex"40", "жеткиликтүү эмес");
        set(hex"41", "Жеткиликтүү");
        set(hex"42", "Бир азга токтотулду");
        set(hex"43", "кезекте");
        set(hex"44", "Эмес, жеткиликтүү, бирок");
        set(hex"45", "Күтүп Сиздин Availability");
        set(hex"46", "мөөнөтү");
        set(hex"48", "мурунтан эле кереги жок");
        set(hex"4F", "Болушу эрежелери же Info (экс-жылдан бери же чейин. Убактысы)");

        set(hex"50", "өткөрүп берүү ишке ашкан жок");
        set(hex"51", "өткөрүүсү Ийгиликтүү");
        set(hex"52", "Төлөм Башкалардан күтүп");
        set(hex"53", "Ээлөө же Эскроу");
        set(hex"54", "каражаттын жетишсиздиги");
        set(hex"55", "каражат суралды");
        set(hex"56", "Transfer Көлөмү ашты");
        set(hex"58", "Каражат талап кылынбайт");
        set(hex"5F", "Токен же каржылык маалыматтар");

        set(hex"A0", "App багытын бузуу");
        set(hex"A1", "App-тиешелуу ийгилик");
        set(hex"A2", "App-тиешелуу күткүлө Башкалар");
        set(hex"A3", "App-тиешелуу кабыл алуу");
        set(hex"A4", "App-тиешелуу Төмөндө абалы");
        set(hex"A5", "App-айрым Receiver Action Суралган");
        set(hex"A6", "App-айрым Бүткөн же Limit");
        set(hex"A8", "App-тиешелуу Колдонулбаган абалы");
        set(hex"AF", "App-айрым Meta же Info");

        set(hex"E0", "чечмелөө аткарбоо");
        set(hex"E1", "чечмелөө ийгилик");
        set(hex"E2", "Күтүп Башка Колдор же сыры");
        set(hex"E3", "кол коюу аземи болуп өттү");
        set(hex"E4", "Коюлбаган же Ишенимсиз");
        set(hex"E5", "Кол коюу талап кылынат");
        set(hex"E6", "Бузуу үчүн белгилүү");
        set(hex"E8", "Кол же жокпу ИП");
        set(hex"EF", "Колдонмо, ID, же Proof Metadata");

        set(hex"F0", "Off-Желеси аткарбоо");
        set(hex"F1", "Off-Желеси Ийгиликтин");
        set(hex"F2", "Күтүп Off-Chain Process");
        set(hex"F3", "Off-Chain Process баштады");
        set(hex"F4", "Off-Желеси кызматы Unreachable");
        set(hex"F5", "Off-Нарк-аракет талап кылынат");
        set(hex"F6", "Off-Желеси Бүткөн же чегине жетти");
        set(hex"F8", "Дубликат Off-Chain суроо");
        set(hex"FF", "Off-Желеси Info же Meta");
    }
}