pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract LaoLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "ຄວາມລົ້ມເຫຼວຂອງ");
        set(hex"01", "ຄວາມ​ສໍາ​ເລັດ");
        set(hex"02", "ກໍາລັງລໍຄວາມອື່ນໆ");
        set(hex"03", "ຍອມຮັບ");
        set(hex"04", "ຈໍາກັດຕ່ໍາຫຼືບໍ່ພຽງພໍ");
        set(hex"05", "ຮັບປະຕິບັດຂໍ");
        set(hex"06", "ເທິງຈໍາກັດ");
        set(hex"08", "ຊ້ໍາກັນ, Unnessesary ຫລືໃຊ້ບໍ່");
        set(hex"0F", "ຂໍ້ມູນຫລື Metadata");

        set(hex"10", "ຮັບອະນຸຍາດຫລືຢຸດ");
        set(hex"11", "ອະນຸຍາດໃຫ້ຫຼືໄປ");
        set(hex"12", "ກໍາລັງລໍອື່ນຂອງການອະນຸຍາດ");
        set(hex"13", "ການອະນຸຍາດຂໍ");
        set(hex"14", "ເປີດເກີນໄປ / ບໍ່ປອດໄພ");
        set(hex"15", "ຕ້ອງການອະນຸຍາດຫຼືການຮ້ອງຂໍຂອງທ່ານສໍາລັບການສືບຕໍ່");
        set(hex"16", "ຍົກເລີກຫຼືຫ້າມ");
        set(hex"18", "ບໍ່ສາມາດໃຊ້ກັບສະຖານະ");
        set(hex"1F", "ລາຍລະອຽດອະນຸຍາດຫຼືສະພາບການຄວບຄຸມ");

        set(hex"20", "ບໍ່ພົບ, ເທົ່າທຽມກັນ, ຫຼື Out of Range");
        set(hex"21", "ພົບ, ສະເຫມີພາບຫຼືໃນຊ່ວງ");
        set(hex"22", "ກໍາລັງລໍຄໍາວ່າ");
        set(hex"23", "ການແຂ່ງຂັນຮ້ອງຂໍສົ່ງ");
        set(hex"24", "ຕ່ໍາກວ່າ Range ຫຼື Underflow");
        set(hex"25", "ຂໍຄໍາວ່າ");
        set(hex"26", "ຂ້າງເທິງ Range ຫຼື Overflow");
        set(hex"28", "ຊ້ໍາກັນ, Conflict, ຫຼື Collision");
        set(hex"2F", "ໂຍບາຍຄວາມລັບ Meta ຫຼື Info");

        set(hex"30", "disagreeable ສົ່ງຫລືບໍ່ເລີຍ");
        set(hex"31", "ສົ່ງເຫັນພ້ອມກັບຕົນຫລືແທ້ຈິງແລ້ວ");
        set(hex"32", "ກໍາລັງລໍຄວາມສັດຕະຍາບັນ");
        set(hex"33", "ການສະເຫນີສົ່ງຫລືໂຫວດ");
        set(hex"34", "ກຸ່ມໂຄຣໍາບໍ່ຜູ້ໃຊ້ອອນລາຍ");
        set(hex"35", "ສັດຕະຍາບັນຮັບຂອງຂໍ");
        set(hex"36", "ການສະເຫນີຫຼືລົງຄະແນນສຽງຈໍາກັດຜູ້ໃຊ້ອອນລາຍ");
        set(hex"38", "ໂຫວດແລ້ວ");
        set(hex"3F", "ກົດລະບຽບການເຈລະຈາຫລືຂໍ້ມູນການມີສ່ວນຮ່ວມ");

        set(hex"40", "ບໍ່ມີເລີຍ");
        set(hex"41", "ສາມາດໃຊ້ໄດ້");
        set(hex"42", "ຢຸດຊົ່ວຄາວ");
        set(hex"43", "ຄິວ");
        set(hex"44", "ບໍ່ມີແຕ່");
        set(hex"45", "ກໍາລັງລໍຄວາມຫວ່າງຂອງທ່ານ");
        set(hex"46", "ຫມົດອາຍຸ");
        set(hex"48", "Done ແລ້ວ");
        set(hex"4F", "ກົດລະບຽບບໍລິສັດຯ Info (ex. ທີ່ໃຊ້ເວລານັບຕັ້ງແຕ່ຫຼືຈົນກ່ວາ)");

        set(hex"50", "ການຖ່າຍໂອນລົ້ມເຫລວ");
        set(hex"51", "ໂອນສົບຜົນສໍາເລັດ");
        set(hex"52", "ກໍາລັງລໍການຊໍາລະເງິນຈາກຄົນອື່ນ ໆ");
        set(hex"53", "ຖືຫຼື Escrow");
        set(hex"54", "ກອງທຶນບໍ່ພຽງພໍ");
        set(hex"55", "ກອງທຶນການຂໍຈອງ");
        set(hex"56", "Transfer Volume ເກີນ");
        set(hex"58", "ກອງທຶນບໍ່ຕ້ອງການ");
        set(hex"5F", "ຂໍ້ມູນ Token ຫຼືການເງິນ");

        set(hex"A0", "ຄວາມລົ້ມເຫຼວ App ສະເພາະ");
        set(hex"A1", "ຄວາມສໍາເລັດ App ສະເພາະ");
        set(hex"A2", "App ສະເພາະກໍາລັງລໍຄວາມອື່ນໆ");
        set(hex"A3", "ການຍອມຮັບ App ສະເພາະ");
        set(hex"A4", "App ສະເພາະຕ່ໍາກວ່າສະພາບ");
        set(hex"A5", "App ສະເພາະຮັບປະຕິບັດຂໍ");
        set(hex"A6", "App ສະເພາະຫມົດອາຍຸຫລືຈໍາກັດ");
        set(hex"A8", "App ສະເພາະສະພາບໃຊ້ບໍ່");
        set(hex"AF", "App ສະເພາະ Meta ຫຼື Info");

        set(hex"E0", "ຖອດລະຫັດລົ້ມເຫລວ");
        set(hex"E1", "ຖອດລະຫັດຄວາມສໍາເລັດ");
        set(hex"E2", "ກໍາລັງລໍຄວາມ Signatures ອື່ນຫຼື Keys");
        set(hex"E3", "ເຊັນ");
        set(hex"E4", "Unsigned ຫລືບໍ່ຫນ້າເຊື່ອຖື");
        set(hex"E5", "ລາຍເຊັນທີ່ກໍານົດໄວ້");
        set(hex"E6", "ເປັນທີ່ຮູ້ຈັກທີ່ຈະໄດ້ຮັບການຫຼຸດຫນ້ອຍລົງ");
        set(hex"E8", "ແລ້ວລົງຫລືບໍ່ເຂົ້າລະຫັດ");
        set(hex"EF", "cryptography, ID, ຫຼື Metadata ຫຼັກຖານສະແດງ");

        set(hex"F0", "ເບີຖະ Chain ລົ້ມເຫລວ");
        set(hex"F1", "ເບີຖະ Chain ຄວາມສໍາເລັດ");
        set(hex"F2", "ກໍາລັງລໍຂະບວນການຫັນເປັນລະບົບຕ່ອງໂສ້");
        set(hex"F3", "ຂະບວນການຫັນເປັນລະບົບຕ່ອງໂສ້ເລີ່ມຕົ້ນ");
        set(hex"F4", "ເບີຖະ Chain Service Unreachable");
        set(hex"F5", "ເບີຖະ Chain ປະຕິບັດທີ່ກໍານົດໄວ້");
        set(hex"F6", "ເບີຖະ Chain ຫມົດອາຍຸຫລືຈໍາກັດຜູ້ໃຊ້ອອນລາຍ");
        set(hex"F8", "ຊ້ໍາເບີ Chain ຂໍ");
        set(hex"FF", "ເບີຖະ Chain Info ຫຼື Meta");
    }
}