pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract MalayalamLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "പരാജയം");
        set(hex"01", "വിജയം");
        set(hex"02", "മറ്റുള്ളവ കാത്തിരിക്കുന്നു");
        set(hex"03", "സ്വീകരിച്ചു");
        set(hex"04", "ലോവർ പരിധി അല്ലെങ്കിൽ അപര്യാപ്തമാണ്");
        set(hex"05", "റിസീവർ പ്രവൃത്തി അഭ്യർത്ഥിച്ചു");
        set(hex"06", "ഉയർന്ന പരിധി");
        set(hex"08", "തനിപ്പകർപ്പ്, ഉംനെഷെസര്യ്, അല്ലെങ്കിൽ ബാധകമല്ലാത്ത");
        set(hex"0F", "വിവരണാത്മക അല്ലെങ്കിൽ മെറ്റാഡാറ്റ");

        set(hex"10", "അനുവദനീയമല്ലാത്ത അല്ലെങ്കിൽ നിർത്തുക");
        set(hex"11", "അനുവദനീയമല്ല ഗോ");
        set(hex"12", "മറ്റു അനുമതി കാത്തിരിക്കുന്നു");
        set(hex"13", "അനുമതി അഭ്യർത്ഥിച്ചു");
        set(hex"14", "/ സുരക്ഷിതമല്ല വളരെ തുറക്കുക");
        set(hex"15", "തുടർച്ചയെ നിങ്ങളുടെ അനുമതി അഭ്യർത്ഥന Needs");
        set(hex"16", "പിൻവലിച്ചു അല്ലെങ്കിൽ നിരോധിച്ചു");
        set(hex"18", "ഇപ്പോഴത്തെ സംസ്ഥാന ബാധകമല്ല");
        set(hex"1F", "അനുമതി വിശദാംശങ്ങൾ അല്ലെങ്കിൽ നിയന്ത്രണ നിബന്ധനകളും");

        set(hex"20", "കണ്ടെത്തിയില്ല, രണ്ടുതരം, അല്ലെങ്കിൽ ശ്രേണിയുടെ ഔട്ട്");
        set(hex"21", "കണ്ടെത്തി, അഥവാ ശ്രേണിയിലെ");
        set(hex"22", "മാച്ച് കാത്തിരിക്കുന്നു");
        set(hex"23", "മാച്ച് അഭ്യർത്ഥന അയച്ചു");
        set(hex"24", "റേഞ്ച് അല്ലെങ്കിൽ ഉംദെര്ഫ്ലൊവ് താഴെ");
        set(hex"25", "മാച്ച് അഭ്യർത്ഥന");
        set(hex"26", "ശ്രേണി അല്ലെങ്കിൽ ഓവർഫ്ലോ മുകളിൽ");
        set(hex"28", "തനിപ്പകർപ്പ്, സംഘർഷം, അല്ലെങ്കിൽ കൂട്ടിയിടിയുടെ");
        set(hex"2F", "പൊരുത്തപ്പെടുന്ന മെറ്റാ അല്ലെങ്കിൽ വിവരങ്ങൾ");

        set(hex"30", "പ്രേഷിത അനുകൂലിക്കുന്നില്ല അല്ലെങ്കിൽ അല്ല");
        set(hex"31", "പ്രേഷിത സമ്മതിക്കുന്നു അല്ലെങ്കിൽ അതേ");
        set(hex"32", "ഉടമ്പടിയുടെ കാത്തിരിക്കുന്നു");
        set(hex"33", "ഓഫർ അയച്ചു അല്ലെങ്കിൽ വോട്ടുചെയ്തു");
        set(hex"34", "ക്വാറം നിർണ്ണയത്തിലെത്തിയിട്ടില്ല");
        set(hex"35", "സ്വീകർത്താവിന്റെ ഉടമ്പടിയുടെ അഭ്യർത്ഥിച്ചു");
        set(hex"36", "ഓഫർ അല്ലെങ്കിൽ വോട്ട് പരിധി എത്തി");
        set(hex"38", "ഇതിനകം വോട്ട്");
        set(hex"3F", "ചർച്ചകളിലൂടെ നിയമങ്ങൾ അല്ലെങ്കിൽ പങ്കാളിത്തം വിവരങ്ങൾ");

        set(hex"40", "ലഭ്യമല്ല");
        set(hex"41", "ലഭ്യമായ");
        set(hex"42", "താൽക്കാലികമായി നിർത്തി");
        set(hex"43", "ക്യൂ");
        set(hex"44", "ഇതുവരെ ലഭ്യമല്ല");
        set(hex"45", "നിങ്ങളുടെ ലഭ്യത കാത്തിരിക്കുന്നു");
        set(hex"46", "കാലഹരണപ്പെട്ടു");
        set(hex"48", "ഇതിനകം ചെയ്തുകഴിഞ്ഞു");
        set(hex"4F", "ലഭ്യത നിയമങ്ങൾ അല്ലെങ്കിൽ വിവരങ്ങളും (ഉദാ. മുതൽ അല്ലെങ്കിൽ വരെ സമയം)");

        set(hex"50", "ട്രാൻസ്ഫർ പരാജയപ്പെട്ടു");
        set(hex"51", "വിജയകരം ട്രാൻസ്ഫർ");
        set(hex"52", "മറ്റുള്ളവരിൽ നിന്നും പേയ്മെന്റ് കാത്തിരിക്കുന്നു");
        set(hex"53", "പിടിക്കുക അല്ലെങ്കിൽ എസ്ക്രൊ");
        set(hex"54", "മതിയായ ഫണ്ട്");
        set(hex"55", "അഭ്യർത്ഥിച്ചു ഫണ്ടുകൾ");
        set(hex"56", "ട്രാൻസ്ഫർ വോളിയം കവിഞ്ഞു");
        set(hex"58", "ഫണ്ട് ആവശ്യമില്ല");
        set(hex"5F", "ടോക്കൺ അല്ലെങ്കിൽ സാമ്പത്തിക വിവരങ്ങൾ");

        set(hex"A0", "അപ്ലിക്കേഷൻ-നിർദ്ദിഷ്ട പരാജയം");
        set(hex"A1", "അപ്ലിക്കേഷൻ-നിർദ്ദിഷ്ട വിജയം");
        set(hex"A2", "അപ്ലിക്കേഷൻ-നിർദ്ദിഷ്ട മറ്റുള്ളവരെ കാത്തിരിക്കുന്നു");
        set(hex"A3", "അപ്ലിക്കേഷൻ-നിർദ്ദിഷ്ട സ്വീകാര്യതയും");
        set(hex"A4", "കണ്ടീഷൻ താഴെ നിർദ്ദിഷ്ട അപ്ലിക്കേഷൻ");
        set(hex"A5", "അപ്ലിക്കേഷൻ-നിർദ്ദിഷ്ട റിസീവർ പ്രവൃത്തി അഭ്യർത്ഥിച്ചു");
        set(hex"A6", "അപ്ലിക്കേഷൻ-നിർദ്ദിഷ്ട കാലഹരണത്തിന്റേയോ പരിധി");
        set(hex"A8", "അപ്ലിക്കേഷൻ-നിർദ്ദിഷ്ട ബാധകമല്ലാത്ത കണ്ടീഷൻ");
        set(hex"AF", "അപ്ലിക്കേഷൻ-നിർദ്ദിഷ്ട മെറ്റാ അല്ലെങ്കിൽ വിവരങ്ങൾ");

        set(hex"E0", "പരാജയം ഡീക്രിപ്റ്റുചെയ്യുക");
        set(hex"E1", "വിജയം ഡീക്രിപ്റ്റുചെയ്യുക");
        set(hex"E2", "മറ്റ് ഒപ്പുകൾ അല്ലെങ്കിൽ കീകൾ കാത്തിരിക്കുന്നു");
        set(hex"E3", "സൈൻ ഇൻ");
        set(hex"E4", "ഒപ്പിടാത്തത് അല്ലെങ്കിൽ അധികാരമില്ലാത്ത");
        set(hex"E5", "സിഗ്നേച്ചർ ആവശ്യമാണ്");
        set(hex"E6", "അപഹരിക്കപ്പെട്ട അറിയപ്പെടുന്നു");
        set(hex"E8", "ഇതിനകം, അല്ലെങ്കിൽ എൻക്രിപ്റ്റ്");
        set(hex"EF", "ക്രിപ്റ്റോഗ്രഫി, ഐഡി, അല്ലെങ്കിൽ തെളിവ് മെറ്റാഡാറ്റ");

        set(hex"F0", "ഓഫ്-ചെയിൻ പരാജയം");
        set(hex"F1", "ഓഫ്-ചെയിൻ വിജയം");
        set(hex"F2", "ഓഫ്-ചെയിൻ പ്രക്രിയ കാത്തിരിക്കുന്നു");
        set(hex"F3", "ഓഫ്-ചെയിൻ പ്രക്രിയ ആരംഭിച്ചു");
        set(hex"F4", "ഓഫ്-ചെയിൻ സേവനം എത്തിച്ചേരാൻ");
        set(hex"F5", "ഓഫ്-ചെയിൻ പ്രവർത്തനം ആവശ്യമാണ്");
        set(hex"F6", "ഓഫ്-ചെയിൻ കാലഹരണത്തിന്റേയോ പരിധി എത്തി");
        set(hex"F8", "ഓഫ്-ചെയിൻ അഭ്യർത്ഥന തനിപ്പകർപ്പ്");
        set(hex"FF", "ഓഫ്-ചെയിൻ വിവരങ്ങളും അല്ലെങ്കിൽ മെറ്റാ");
    }
}