pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract MarathiLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "अयशस्वी");
        set(hex"01", "यशस्वी");
        set(hex"02", "इतर प्रतीक्षा करत आहे");
        set(hex"03", "स्वीकारले");
        set(hex"04", "लोअर मर्यादा किंवा अपुरी");
        set(hex"05", "स्वीकारणारा क्रिया विनंती");
        set(hex"06", "उच्च मर्यादा");
        set(hex"08", "डुप्लिकेट, Unnessesary, किंवा लागू करण्यायोग्य नसलेले");
        set(hex"0F", "माहितीपर किंवा मेटाडेटा");

        set(hex"10", "परवानगी किंवा थांबवा");
        set(hex"11", "अनुमती देण्यात येईल किंवा जा");
        set(hex"12", "इतर परवानगी प्रतीक्षा करत आहे");
        set(hex"13", "परवानगीची विनंती केली");
        set(hex"14", "खूप उघडा / असुरक्षित");
        set(hex"15", "पुढे चालू ठेवण्याबाबत आपली परवानगी किंवा विनंती गरज");
        set(hex"16", "मागे घेतला किंवा बंदी");
        set(hex"18", "चालू राज्य लागू होत नाही");
        set(hex"1F", "परवानगी तपशील किंवा नियंत्रण अटी");

        set(hex"20", "सापडले नाही, चुकीची किंवा श्रेणी बाहेर");
        set(hex"21", "सापडले, समान किंवा श्रेणी मध्ये");
        set(hex"22", "सामना प्रतीक्षा करत आहे");
        set(hex"23", "मॅच विनंती पाठवली");
        set(hex"24", "श्रेणी किंवा Underflow खाली");
        set(hex"25", "सामना विनंती");
        set(hex"26", "श्रेणी किंवा ओव्हरफ्लो वर");
        set(hex"28", "डुप्लिकेट, विरोध, किंवा टक्कर");
        set(hex"2F", "मेटा किंवा माहिती जुळणारे");

        set(hex"30", "प्रेषक असहमत किंवा नाही");
        set(hex"31", "प्रेषक सहमत किंवा होय");
        set(hex"32", "प्रतीक्षा करत आहे मंजुरी");
        set(hex"33", "ऑफर पाठविले किंवा मत दिले");
        set(hex"34", "सदस्यांनी गणपूर्ती गाठली नाही");
        set(hex"35", "स्वीकारणारा मंजुरी विनंती");
        set(hex"36", "ऑफर किंवा मत मर्यादा गाठली");
        set(hex"38", "आधीच मत");
        set(hex"3F", "बोलणी नियम किंवा सहभाग माहिती");

        set(hex"40", "अनुपलब्ध");
        set(hex"41", "उपलब्ध");
        set(hex"42", "विराम दिला");
        set(hex"43", "रांगेत");
        set(hex"44", "अद्याप उपलब्ध नाही");
        set(hex"45", "आपले उपलब्धता प्रतीक्षा करत आहे");
        set(hex"46", "कालबाह्य झाले");
        set(hex"48", "आधीच पूर्ण झाले");
        set(hex"4F", "उपलब्धता नियम किंवा माहिती (माजी पासून किंवा पर्यंत. वेळ)");

        set(hex"50", "हस्तांतरण अयशस्वी");
        set(hex"51", "यशस्वी हस्तांतरण");
        set(hex"52", "इतर भरणा प्रतीक्षा करत आहे");
        set(hex"53", "धरा किंवा एस्क्रो");
        set(hex"54", "अपुरा निधी");
        set(hex"55", "निधी विनंती");
        set(hex"56", "हस्तांतरण वॉल्यूम ओलांडलेला");
        set(hex"58", "निधी आवश्यक नाही");
        set(hex"5F", "टोकन किंवा आर्थिक माहिती");

        set(hex"A0", "अनुप्रयोग-विशिष्ट अयशस्वी");
        set(hex"A1", "अनुप्रयोग-विशिष्ट यशस्वी");
        set(hex"A2", "अनुप्रयोग-विशिष्ट प्रतीक्षा करत आहे इतर");
        set(hex"A3", "अनुप्रयोग-विशिष्ट स्वीकार");
        set(hex"A4", "अट खाली अनुप्रयोग-विशिष्ट");
        set(hex"A5", "अनुप्रयोग-विशिष्ट रीसीव्हर क्रिया विनंती");
        set(hex"A6", "अनुप्रयोग-विशिष्ट कालावधी समाप्ती किंवा मर्यादा");
        set(hex"A8", "अनुप्रयोग-विशिष्ट लागू करण्यायोग्य नसलेले अट");
        set(hex"AF", "अनुप्रयोग-विशिष्ट मेटा किंवा माहिती");

        set(hex"E0", "अयशस्वी उकल");
        set(hex"E1", "यशस्वी उकल");
        set(hex"E2", "इतर स्वाक्षर्या किंवा की प्रतीक्षा करत आहे");
        set(hex"E3", "साइन इन");
        set(hex"E4", "स्वाक्षरी न केलेल्या किंवा खात्रीलायक");
        set(hex"E5", "स्वाक्षरी आवश्यक");
        set(hex"E6", "तडजोड करणे ज्ञात");
        set(hex"E8", "साइन किंवा नाही एनक्रिप्टेड");
        set(hex"EF", "क्रिप्टोग्राफी, ID किंवा पुरावा मेटाडेटा");

        set(hex"F0", "ऑफ-चेन अयशस्वी");
        set(hex"F1", "ऑफ-चेन यशस्वी");
        set(hex"F2", "प्रतीक्षा करत आहे ऑफ-साखळी प्रक्रिया");
        set(hex"F3", "ऑफ-साखळी प्रक्रिया सुरु");
        set(hex"F4", "ऑफ-चेन सेवा आवाक्याबाहेर");
        set(hex"F5", "ऑफ-साखळी क्रिया आवश्यक");
        set(hex"F6", "ऑफ-साखळी कालावधी समाप्ती किंवा मर्यादा गाठली");
        set(hex"F8", "डुप्लिकेट ऑफ-चेन विनंती");
        set(hex"FF", "ऑफ-साखळी माहिती किंवा मेटा");
    }
}