pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract MongolianLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "дутагдал");
        set(hex"01", "Амжилтын");
        set(hex"02", "Бусдыг хүлээж");
        set(hex"03", "хүлээн авах");
        set(hex"04", "Доод хязгаар буюу хангалтгүй");
        set(hex"05", "Хүлээн авагчийн үйл ажиллагааны хүссэн");
        set(hex"06", "дээд хязгаар");
        set(hex"08", "Duplicate, Unnessesary, буюу ашиглах боломжгүй");
        set(hex"0F", "Мэдээллийн болон Мета");

        set(hex"10", "Зөвшөөрөгдөөгүй эсвэл зогсоох");
        set(hex"11", "Зөвшөөрөгдсөн эсвэл Go");
        set(hex"12", "Бусдын зөвшөөрөл хүлээж");
        set(hex"13", "зөвшөөрөл хүссэн");
        set(hex"14", "Аюултай Хэтэрхий Нээлттэй /");
        set(hex"15", "Үргэлжлэл нь таны зөвшөөрөлгүйгээр, хүсэлт шаардлагатай");
        set(hex"16", "Хүчингүй болгох, эсвэл хорисон");
        set(hex"18", "Одоогийн улсад хэрэглэх боломжгүй");
        set(hex"1F", "Зөвшөөрөл дэлгэрэнгүй мэдээлэл болон хяналт нөхцөл");

        set(hex"20", ", Тэгш бус Олдсон биш, эсвэл нурууны гарч");
        set(hex"21", "Олдсон Тэгш эсвэл мужийн");
        set(hex"22", "эд зүйлс хүлээж");
        set(hex"23", "Хүсч байгаа эд зүйлс авагч Явсан");
        set(hex"24", "Нуруу, эсвэл шандны доор");
        set(hex"25", "Тоглолтын авагч");
        set(hex"26", "Нуруу, эсвэл халих дээш");
        set(hex"28", "Duplicate, зөрчилдөөн, эсвэл Collision");
        set(hex"2F", "Мета болон Мэдээлэл тохирох");

        set(hex"30", "Илгээгч эс зөвшөөрвөл, эсвэл Үгүй");
        set(hex"31", "Илгээгч зөвшөөрсөн, эсвэл Тийм ээ");
        set(hex"32", "хүлээж соёрхон батлах");
        set(hex"33", "Санал илгээсэн, эсхүл Санал өгсөн");
        set(hex"34", "Чуулгын хүрч чадахгүй");
        set(hex"35", "Хүлээн авагч улсын Соёрхон батлах хүссэн");
        set(hex"36", "Санал болгох, эсвэл санал хязгаар хүрсэн");
        set(hex"38", "Аль хэдийн Санал өгсөн");
        set(hex"3F", "Хэлэлцээр журам, эсвэл оролцоо мэдээлэл");

        set(hex"40", "Боломжгүй");
        set(hex"41", "Боломжит");
        set(hex"42", "дуугүй болов");
        set(hex"43", "дараалалд");
        set(hex"44", "Байхгүй байгаа хэдий ч");
        set(hex"45", "Таны хүртээмжийг хүлээж");
        set(hex"46", "Хугацаа нь дууссан");
        set(hex"48", "Аль хэдийнэ дууссан");
        set(hex"4F", "Хүртээмжтэй журам буюу Мэдээлэл (экс. Оноос хойш буюу хүртэл цаг)");

        set(hex"50", "Дамжуулах чадсангүй");
        set(hex"51", "амжилттай шилжүүлэх");
        set(hex"52", "Бусад төлбөр хүлээж");
        set(hex"53", "Зохион эсвэл Эскроу");
        set(hex"54", "хангалтгүй сан");
        set(hex"55", "сан хүссэн");
        set(hex"56", "Дамжуулах Боть хэтэрсэн");
        set(hex"58", "Хөрөнгө шаардлагатай биш");
        set(hex"5F", "Token болон Санхүүгийн мэдээллийн");

        set(hex"A0", "Апп-д алдаа");
        set(hex"A1", "Апп-д амжилт");
        set(hex"A2", "Апп-д ирэлтийг хүлээж Бусад");
        set(hex"A3", "Апп-д хүлээн зөвшөөрөх");
        set(hex"A4", "App-Тодорхой нөхцөл доор");
        set(hex"A5", "Апп-д зориулсан хүлээн авагч үйл ажиллагааны хүссэн");
        set(hex"A6", "Апп-д дуусгавар болох буюу хязгаар");
        set(hex"A8", "Апп-д өгөхөд байдал");
        set(hex"AF", "Апп-д Мета, эсвэл мэдээлэл");

        set(hex"E0", "Алдаа буцаах");
        set(hex"E1", "амжилтын буцаах");
        set(hex"E2", "Хүлээж Бусад гарын үсэг зурсан буюу Товчнууд");
        set(hex"E3", "Гарын үсэг зурсан");
        set(hex"E4", "Гарын үсэг зураагүй, эсвэл итгэлгүй");
        set(hex"E5", "Гарын үсэг зурах шаардлагатай");
        set(hex"E6", "Эвдэгдсэн байж мэдэх");
        set(hex"E8", "Аль хэдийн гарын үсэг зурсан буюу бус, шифрлэгдсэн");
        set(hex"EF", "Криптограф, ID, эсвэл баталгаа Мета");

        set(hex"F0", "Off-гинжин хэлхээний алдаа");
        set(hex"F1", "Off-гинжин хэлхээний Амжилтын");
        set(hex"F2", "Хүлээж Off-гинжин үйл явц");
        set(hex"F3", "Off-гинжин процесс эхэлсэн");
        set(hex"F4", "Off-гинжин хэлхээний холбогдох боломжгүй үйлчилгээ");
        set(hex"F5", "Off-гинжин хэлхээний үйл ажиллагааны шаардлагатай");
        set(hex"F6", "Off-Chain дуусах, эсвэл хязгаарт хүрсэн");
        set(hex"F8", "Хуулбар Off-гинжин авагч");
        set(hex"FF", "Off-Chain Мэдээлэл, эсвэл мета");
    }
}