pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract NepaliLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "विफलता");
        set(hex"01", "सफलता");
        set(hex"02", "अरूले पर्खाइमा");
        set(hex"03", "स्वीकार");
        set(hex"04", "तल्लो सीमा वा अपर्याप्त");
        set(hex"05", "रिसीभर कार्य अनुरोध");
        set(hex"06", "माथिल्लो सीमा");
        set(hex"08", "नक्कली, Unnessesary, वा Inapplicable");
        set(hex"0F", "जानकारी वा मेटाडेटा");

        set(hex"10", "अस्वीकृत वा रोक्नुहोस्");
        set(hex"11", "अनुमति वा जानुहोस्");
        set(hex"12", "अन्य गरेको अनुमति पर्खाइमा");
        set(hex"13", "अनुमति अनुरोध");
        set(hex"14", "धेरै खुला / असुरक्षित");
        set(hex"15", "लडी लागि तपाईंको अनुमति वा अनुरोध आवश्यक");
        set(hex"16", "खारेज वा प्रतिबन्धित");
        set(hex"18", "वर्तमान राज्य गर्न लागू छैन");
        set(hex"1F", "अनुमति विवरण वा नियन्त्रण स्थितिहरु");

        set(hex"20", ", Unequal फेला परेन, वा दायरा बाहिर");
        set(hex"21", "मिली, बराबर वा दायरामा");
        set(hex"22", "मिलान पर्खाइमा");
        set(hex"23", "मिलान अनुरोध पठाइयो");
        set(hex"24", "तल सीमा वा Underflow");
        set(hex"25", "मिलान लागि अनुरोध");
        set(hex"26", "सीमा वा ओभरफ्लो माथि");
        set(hex"28", "नक्कली, द्वन्द्व, वा टकराव");
        set(hex"2F", "मेटा वा जानकारी मिल्ने");

        set(hex"30", "प्रेषक असहमत वा Nay");
        set(hex"31", "प्रेषक सहमत वा Yea");
        set(hex"32", "पर्खाइमा Ratification");
        set(hex"33", "प्रस्ताव पठाइयो वा मतदान");
        set(hex"34", "इयत्ता पुग्यो छैन");
        set(hex"35", "प्राप्तकर्ताको Ratification अनुरोध");
        set(hex"36", "प्रस्ताव वा भोट सीमा पुग्यो");
        set(hex"38", "पहिले नै मतदान");
        set(hex"3F", "बातचीत नियम वा सहभागिता जानकारी");

        set(hex"40", "उपलब्ध");
        set(hex"41", "उपलब्ध");
        set(hex"42", "रोकिएको");
        set(hex"43", "लामबद्ध");
        set(hex"44", "उपलब्ध यद्यपि");
        set(hex"45", "तपाईंको उपलब्धता पर्खाइमा");
        set(hex"46", "म्याद समाप्त भयो");
        set(hex"48", "पहिले नै गरेको");
        set(hex"4F", "उपलब्धता नियम वा जानकारी (पूर्व। पछि वा सम्म समय)");

        set(hex"50", "स्थानान्तरण असफल भयो");
        set(hex"51", "स्थानान्तरण सफल");
        set(hex"52", "अरूबाट भुक्तानी पर्खाइमा");
        set(hex"53", "पकड वा इस्क्रो");
        set(hex"54", "अपर्याप्त कोष");
        set(hex"55", "धन अनुरोध");
        set(hex"56", "स्थानान्तरण मात्रा नाघ्यो");
        set(hex"58", "धन आवश्यक छैन");
        set(hex"5F", "टोकन वा वित्तीय सूचना");

        set(hex"A0", "अनुप्रयोग-विशिष्ट विफलता");
        set(hex"A1", "अनुप्रयोग-विशिष्ट सफलता");
        set(hex"A2", "अनुप्रयोग-विशिष्ट पर्खाइमा अरूले");
        set(hex"A3", "अनुप्रयोग-विशिष्ट स्वीकृति");
        set(hex"A4", "तल स्थिति अनुप्रयोग-विशिष्ट");
        set(hex"A5", "अनुप्रयोग-विशिष्ट रिसीभर कार्य अनुरोध");
        set(hex"A6", "अनुप्रयोग-विशिष्ट समाप्ति को वा सीमा");
        set(hex"A8", "अनुप्रयोग-विशिष्ट Inapplicable स्थिति");
        set(hex"AF", "अनुप्रयोग-विशिष्ट मेटा वा जानकारी");

        set(hex"E0", "विफलता गुप्त");
        set(hex"E1", "सफलता गुप्त");
        set(hex"E2", "अन्य हस्ताक्षर वा कुञ्जीहरू पर्खाइमा");
        set(hex"E3", "हस्ताक्षर");
        set(hex"E4", "अहस्ताक्षरित वा अविश्वासिलो");
        set(hex"E5", "हस्ताक्षर आवश्यक");
        set(hex"E6", "सम्झौता गर्न ज्ञात");
        set(hex"E8", "पहिले नै हस्ताक्षर वा छैन इन्क्रिप्ट");
        set(hex"EF", "क्रिप्टोग्राफी, आईडी, वा प्रमाण मेटाडेटा");

        set(hex"F0", "बन्द-दल विफलता");
        set(hex"F1", "बन्द-दल सफलता");
        set(hex"F2", "पर्खाइमा अफ-दल प्रक्रिया");
        set(hex"F3", "बन्द-दल प्रक्रिया सुरु");
        set(hex"F4", "बन्द-दल सेवा पहुँचयोग्य");
        set(hex"F5", "बन्द-दल कार्य आवश्यक");
        set(hex"F6", "बन्द-दल समाप्ति को वा सीमा पुग्यो");
        set(hex"F8", "नक्कल अफ-दल अनुरोध");
        set(hex"FF", "बन्द-दल जानकारी वा मेटा");
    }
}