pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract PashtoPushtoLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "راتلل");
        set(hex"01", "د برياليتوب");
        set(hex"02", "په تمه نور");
        set(hex"03", "منل");
        set(hex"04", "د ولسي حد یا ناکافي");
        set(hex"05", "د اخيستونکي عمل غوښتل");
        set(hex"06", "د مشرانو حد");
        set(hex"08", "دوه ګونو، Unnessesary، او یا د يوان");
        set(hex"0F", "د معلوماتي او یا مېټاډاټا");

        set(hex"10", "یا ودرول شي");
        set(hex"11", "اجازه یا لاړ شئ");
        set(hex"12", "نور د اجازې په تمه");
        set(hex"13", "اجازه غوښتل");
        set(hex"14", "هم پرانیستې / امنه");
        set(hex"15", "لپاره د دوام لپاره ستا د اجازې يا غوښتنه اړتیا لري");
        set(hex"16", "لغوه یا د بنديز");
        set(hex"18", "د اوسني حالت د تطبیق وړ نه دی");
        set(hex"1F", "د اجازې د نورولوله یا کنټرول شرايط");

        set(hex"20", "و نه موندل، نامساوي، او یا د Range له جملې څخه");
        set(hex"21", "موندل، مساوي او يا په Range");
        set(hex"22", "په تمه لوبه");
        set(hex"23", "لوبه غوښتنه ولېږل شو");
        set(hex"24", "لاندې Range یا Underflow");
        set(hex"25", "لپاره لوبه غوښتنه");
        set(hex"26", "پورته ښیی یا ننوزي");
        set(hex"28", "دوه ګونو، واله، يا د پوځي اقدام په");
        set(hex"2F", "مطابقت ميتاکارډونه يا پيژندنه");

        set(hex"30", "استوونکی سره موافق او يا هو");
        set(hex"31", "استوونکی ته راضي دي او یا هو");
        set(hex"32", "تمه تصویب");
        set(hex"33", "وړاندیز ته وليږدول شوه او یا رایې ورکړې");
        set(hex"34", "د نصاب نه ته ورسېد.");
        set(hex"35", "د اخيستونکي د تصويب غوښتل");
        set(hex"36", "وړاندیز او یا د رايو حد ته ورسېد.");
        set(hex"38", "مخکې یې رایه");
        set(hex"3F", "د خبرو اترو د اصولو یا د ګډون پيژندنه");

        set(hex"40", "په لاس کې نشته");
        set(hex"41", "شته");
        set(hex"42", "کوونی");
        set(hex"43", "له پيله");
        set(hex"44", "نه شته خو");
        set(hex"45", "په تمه ستاسو شتون");
        set(hex"46", "تېر شوی");
        set(hex"48", "مخکې وشو");
        set(hex"4F", "شتون اصول يا پيژندنه (پخواني راهيسې يا تر وخت.)");

        set(hex"50", "انتقال ناکام");
        set(hex"51", "ته سپاري بریالی");
        set(hex"52", "په تمه د پیسو له نورو");
        set(hex"53", "وکړي او يا زيرمه کړي");
        set(hex"54", "ناکافي پيسې");
        set(hex"55", "د بسپنو غوښتل");
        set(hex"56", "انتقال ټوک زیات شو");
        set(hex"58", "د بسپنو نه اړین");
        set(hex"5F", "د نښې یا مالي معلوماتو په");

        set(hex"A0", "ددفتروسایل-ځانګړې راتلل");
        set(hex"A1", "ددفتروسایل-ځانګړې برياليتوب");
        set(hex"A2", "ددفتروسایل-ځانګړي په تمه نور");
        set(hex"A3", "ددفتروسایل-ځانګړې منل");
        set(hex"A4", "ددفتروسایل-ځانګړې لاندې شرايط");
        set(hex"A5", "ددفتروسایل-ځانګړي د اخيستونکي عمل غوښتل");
        set(hex"A6", "ددفتروسایل-ځانګړي د پای او یا حد");
        set(hex"A8", "ددفتروسایل-ځانګړي د يوان شرايط");
        set(hex"AF", "ددفتروسایل-ځانګړې ميتاکارډونه يا پيژندنه");

        set(hex"E0", "ناکامي ناکوډه");
        set(hex"E1", "د برياليتوب ناکوډه");
        set(hex"E2", "نور لاسليکونه او يا کیلي ګانو په تمه");
        set(hex"E3", "لاسلیک شو");
        set(hex"E4", "السلیک او نااعتباره");
        set(hex"E5", "لاسلیک اړین");
        set(hex"E6", "پېژندل ته راپورته شي");
        set(hex"E8", "مخکې لاسلیک یا نه کوډ");
        set(hex"EF", "کوډکښنې، تذکرو، یا ثبوت مېټاډاټا");

        set(hex"F0", "Off-سلسله راتلل");
        set(hex"F1", "Off-سلسله برياليتوب");
        set(hex"F2", "تمه Off-سلسله بهیر");
        set(hex"F3", "Off-سلسله پروسه پیل");
        set(hex"F4", "Off-سلسله خدمتونو ناشوني دي");
        set(hex"F5", "Off-سلسله عمل اړین");
        set(hex"F6", "Off-سلسله د پای او یا حد ته ورسېد.");
        set(hex"F8", "دوه ګونو Off-سلسله غوښتنه");
        set(hex"FF", "Off-سلسله پيژندنه يا ميتاکارډونه");
    }
}