pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract PersianLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "شکست");
        set(hex"01", "موفقیت");
        set(hex"02", "در انتظار دیگران");
        set(hex"03", "پذیرفته شده");
        set(hex"04", "حد پایین تر و یا ناکافی");
        set(hex"05", "گیرنده اقدام های درخواست شده");
        set(hex"06", "حد بالا");
        set(hex"08", "تکثیر، Unnessesary، یا غیر قابل اعمال");
        set(hex"0F", "اطلاعات و یا فراداده");

        set(hex"10", "مجاز یا توقف");
        set(hex"11", "مجاز یا برو");
        set(hex"12", "در انتظار دیگر را اجازه");
        set(hex"13", "مجوز درخواست");
        set(hex"14", "خیلی باز / ناامن");
        set(hex"15", "نیاز به اجازه و یا درخواست خود را برای ادامه");
        set(hex"16", "لغو و یا ممنوع");
        set(hex"18", "به وضعیت فعلی قابل اجرا نیست");
        set(hex"1F", "اطلاعات کاربری و یا شرایط کنترل");

        set(hex"20", "پیدا نشد، نابرابر، و یا خارج از محدوده");
        set(hex"21", "یافت، مساوی و یا در محدوده");
        set(hex"22", "در انتظار بازی");
        set(hex"23", "بازی درخواست فرستاده");
        set(hex"24", "در زیر محدوده و یا پاریز");
        set(hex"25", "درخواست برای بازی");
        set(hex"26", "بالاتر از محدوده یا سرریز");
        set(hex"28", "تکراری، تعارض، و یا برخورد");
        set(hex"2F", "تطبیق متا یا اطلاعات");

        set(hex"30", "مخالف فرستنده و یا نه");
        set(hex"31", "فرستنده موافقت یا بله");
        set(hex"32", "در انتظار تصویب");
        set(hex"33", "پیشنهاد فرستاده و یا امتیازدهی");
        set(hex"34", "حد نصاب نرسیده است");
        set(hex"35", "تصویب گیرنده های درخواست شده");
        set(hex"36", "پیشنهاد و یا رای هفته:");
        set(hex"38", "در حال حاضر رای");
        set(hex"3F", "قوانین مذاکره یا اطلاعات مشارکت");

        set(hex"40", "غیر قابل دسترسی");
        set(hex"41", "در دسترس");
        set(hex"42", "مکث");
        set(hex"43", "در نوبت");
        set(hex"44", "موجود نمی باشد با این حال");
        set(hex"45", "انتظار در دسترس بودن شما");
        set(hex"46", "منقضی شده");
        set(hex"48", "انجام شده");
        set(hex"4F", "قوانین دسترس بودن و یا اطلاعات (مثل زمان سال و یا تا)");

        set(hex"50", "انتقال انجام نشد");
        set(hex"51", "انتقال موفقیت آمیز");
        set(hex"52", "در انتظار پرداخت از دیگران");
        set(hex"53", "نگه دارید و یا سپردن");
        set(hex"54", "بودجه ناکافی");
        set(hex"55", "وجوه درخواست");
        set(hex"56", "انتقال دوره بیش از حد");
        set(hex"58", "سرمایه های مورد نیاز نیست");
        set(hex"5F", "اطلاعات رمز یا مالی");

        set(hex"A0", "شکست برنامه های خاص");
        set(hex"A1", "موفقیت برنامه های خاص");
        set(hex"A2", "برنامه های خاص در انتظار دیگران");
        set(hex"A3", "پذیرش برنامه های خاص");
        set(hex"A4", "برنامه های خاص در زیر ساختار");
        set(hex"A5", "برنامه های خاص گیرنده اقدام های درخواست شده");
        set(hex"A6", "برنامه های خاص انقضاء و یا محدود");
        set(hex"A8", "برنامه های خاص شرط غیر قابل اعمال");
        set(hex"AF", "برنامه های خاص متا یا اطلاعات");

        set(hex"E0", "رمزگشایی شکست");
        set(hex"E1", "رمزگشایی موفقیت");
        set(hex"E2", "در انتظار امضا دیگر و یا کلید");
        set(hex"E3", "امضاء شده");
        set(hex"E4", "بدون علامت و یا غیر قابل اطمینان");
        set(hex"E5", "مورد تأیید");
        set(hex"E6", "شناخته شده به خطر بیافتد");
        set(hex"E8", "در حال حاضر وارد میشوید یا خیر رمزگذاری شده");
        set(hex"EF", "رمزنگاری، ID، و یا فراداده اثبات");

        set(hex"F0", "خارج از زنجیره شکست");
        set(hex"F1", "خارج از زنجیره ای موفقیت");
        set(hex"F2", "در انتظار خارج از فرایند زنجیره ای");
        set(hex"F3", "فرآیند خارج از زنجیره ای آغاز شده");
        set(hex"F4", "خارج از زنجیره خدمات از دسترس");
        set(hex"F5", "خارج از زنجیره ای اقدام لازم");
        set(hex"F6", "خارج از زنجیره ای انقضاء یا هفته:");
        set(hex"F8", "کپی بگیرید خارج از زنجیره درخواست پاسخ به");
        set(hex"FF", "خارج از زنجیره ای اطلاعات متا");
    }
}