pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract PunjabiPanjabiLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "ਅਸਫ਼ਲਤਾ");
        set(hex"01", "ਸਫਲਤਾ");
        set(hex"02", "ਦੂਸਰੇ ਦੀ ਉਡੀਕ");
        set(hex"03", "ਸਵੀਕਾਰ");
        set(hex"04", "ਲੋਅਰ ਸੀਮਾ ਜ ਨਾਕਾਫ਼ੀ");
        set(hex"05", "ਰਿਸੀਵਰ ਕਾਰਵਾਈ ਬੇਨਤੀ");
        set(hex"06", "ਸੀਮਾ");
        set(hex"08", "ਡੁਪਲੀਕੇਟ, Unnessesary, ਜ ਕੰਮ");
        set(hex"0F", "ਸੂਚਨਾ ਜ ਮੈਟਾਡਾਟਾ");

        set(hex"10", "ਰੱਦਿਆ ਜ ਬੰਦ");
        set(hex"11", "ਮਨਜ਼ੂਰ ਜ ਜਾਓ");
        set(hex"12", "ਹੋਰ ਦੇ ਅਧਿਕਾਰ ਦੀ ਉਡੀਕ");
        set(hex"13", "ਦੀ ਇਜਾਜ਼ਤ ਮੰਗੀ");
        set(hex"14", "ਬਹੁਤ ਓਪਨ / ਅਸੁਰੱਖਿਅਤ");
        set(hex"15", "ਜਾਰੀ ਤੁਹਾਡੀ ਆਗਿਆ ਜ ਬੇਨਤੀ ਦੀ ਲੋੜ ਹੈ");
        set(hex"16", "ਰੱਦ ਕੀਤਾ ਜ ਤੇ ਪਾਬੰਦੀ");
        set(hex"18", "ਮੌਜੂਦਾ ਸਥਿਤੀ ਨੂੰ ਲਾਗੂ ਨਾ");
        set(hex"1F", "ਅਧਿਕਾਰ ਵੇਰਵਾ ਜ ਕੰਟਰੋਲ ਹਾਲਾਤ");

        set(hex"20", "ਨਾ ਲੱਭਿਆ, ਨਾਬਰਾਬਰ, ਜ ਸੀਮਾ ਦੇ ਬਾਹਰ");
        set(hex"21", "ਲੱਭਿਆ, ਬਰਾਬਰ ਜ ਸੀਮਾ ਵਿੱਚ");
        set(hex"22", "ਮੈਚ ਦੀ ਉਡੀਕ");
        set(hex"23", "ਮੈਚ ਬੇਨਤੀ ਭੇਜੀ");
        set(hex"24", "ਸੀਮਾ ਹੈ, ਜ Underflow ਹੇਠ");
        set(hex"25", "ਮੈਚ ਲਈ ਬੇਨਤੀ");
        set(hex"26", "ਸੀਮਾ ਹੈ, ਜ ਓਵਰਫਲੋ ਦੇ ਉੱਪਰ");
        set(hex"28", "ਡੁਪਲੀਕੇਟ, ਅਪਵਾਦ, ਜ ਟੱਕਰ");
        set(hex"2F", "ਮੈਟਾ ਜ ਜਾਣਕਾਰੀ ਮਿਲਦੇ");

        set(hex"30", "ਪ੍ਰੇਸ਼ਕ ਸਹਿਮਤ ਜ ਧਨਵਾਨ");
        set(hex"31", "ਪ੍ਰੇਸ਼ਕ ਸਹਿਮਤ ਜ ਨਾਲੇ");
        set(hex"32", "ਉਡੀਕ ਦਾ ਪ੍ਰਮਾਣੀਕਰਨ");
        set(hex"33", "ਪੇਸ਼ਕਸ਼ ਭੇਜਿਆ ਹੈ ਜ ਵੋਟ");
        set(hex"34", "ਕੋਰਮ ਪਹੁੰਚ");
        set(hex"35", "ਰਿਸੀਵਰ ਦੇ ਪ੍ਰਮਾਣੀਕਰਨ ਬੇਨਤੀ");
        set(hex"36", "ਪੇਸ਼ਕਸ਼ ਜ ਵੋਟ ਸੀਮਾ ਤੇ ਪਹੁੰਚ");
        set(hex"38", "ਹੀ ਵੋਟ");
        set(hex"3F", "ਸੁਲਾਹ ਨਿਯਮ ਜ ਸ਼ਮੂਲੀਅਤ ਜਾਣਕਾਰੀ");

        set(hex"40", "ਅਣਉਪਲਬਧ");
        set(hex"41", "ਉਪਲੱਬਧ");
        set(hex"42", "ਵਿਰਾਮ");
        set(hex"43", "ਕਤਾਰ");
        set(hex"44", "ਉਪਲੱਬਧ ਨਾ ਪਰ");
        set(hex"45", "ਤੁਹਾਡਾ ਉਪਲੱਬਧਤਾ ਦੀ ਉਡੀਕ");
        set(hex"46", "ਮਿਆਦ");
        set(hex"48", "ਪਹਿਲਾਂ ਹੀ ਕੀਤਾ ਹੋਇਆ");
        set(hex"4F", "ਉਪਲੱਬਧਤਾ ਨਿਯਮ ਜ ਜਾਣਕਾਰੀ (ਸਾਬਕਾ ਬਾਅਦ ਜ, ਜਦ ਤੱਕ. ਵਾਰ)");

        set(hex"50", "ਸੰਚਾਰ ਲਈ ਫੇਲ੍ਹ ਹੈ");
        set(hex"51", "ਤਬਦੀਲ ਸਫਲ");
        set(hex"52", "ਹੋਰ ਭੁਗਤਾਨ ਦੀ ਉਡੀਕ");
        set(hex"53", "ਹੋਲਡ ਜ ਇਕਰਾਰਨਾਮਾ");
        set(hex"54", "ਲੋੜੀਦੀ ਫੰਡ");
        set(hex"55", "ਫੰਡ ਬੇਨਤੀ");
        set(hex"56", "ਸੰਚਾਰ ਵਾਲੀਅਮ ਵਧੀ");
        set(hex"58", "ਫੰਡ ਦੀ ਲੋੜ ਹੈ ਨਾ");
        set(hex"5F", "ਟੋਕਨ ਜ ਵਿੱਤੀ ਜਾਣਕਾਰੀ");

        set(hex"A0", "ਐਪ-ਵਿਸ਼ੇਸ਼ ਅਸਫਲ");
        set(hex"A1", "ਐਪ-ਵਿਸ਼ੇਸ਼ ਸਫਲਤਾ");
        set(hex"A2", "ਐਪ-ਵਿਸ਼ੇਸ਼ ਦੀ ਉਡੀਕ ਹੋਰ");
        set(hex"A3", "ਐਪ-ਵਿਸ਼ੇਸ਼ ਮਨਜ਼ੂਰੀ");
        set(hex"A4", "ਐਪ-ਵਿਸ਼ੇਸ਼ ਹਾਲਤ ਹੇਠ");
        set(hex"A5", "ਐਪ-ਵਿਸ਼ੇਸ਼ ਰਿਸੀਵਰ ਐਕਸ਼ਨ ਬੇਨਤੀ");
        set(hex"A6", "ਐਪ-ਵਿਸ਼ੇਸ਼ ਮਿਆਦ ਜ ਸੀਮਾ");
        set(hex"A8", "ਐਪ-ਵਿਸ਼ੇਸ਼ ਕੰਮ ਦੇ ਹਾਲਤ");
        set(hex"AF", "ਐਪ-ਵਿਸ਼ੇਸ਼ ਮੈਟਾ ਜ ਜਾਣਕਾਰੀ");

        set(hex"E0", "ਅਸਫ਼ਲਤਾ ਡਿਕ੍ਰਿਪਟ");
        set(hex"E1", "ਸਫਲਤਾ ਡਿਕ੍ਰਿਪਟ");
        set(hex"E2", "ਹੋਰ ਦਸਤਖਤ ਜ ਕੁੰਜੀ ਦੀ ਉਡੀਕ");
        set(hex"E3", "ਦਸਤਖਤ");
        set(hex"E4", "ਦਸਤਖਤੀ ਜ ਭਰੋਸੇਯੋਗ");
        set(hex"E5", "ਦਸਤਖਤ ਦੀ ਲੋੜ ਹੈ");
        set(hex"E6", "ਸਮਝੌਤਾ ਹੋਣ ਲਈ ਜਾਣਿਆ");
        set(hex"E8", "ਹੀ ਜ ਦਸਤਖਤ ਕੀਤੇ, ਨਾ ਇਨਕ੍ਰਿਪਟਡ");
        set(hex"EF", "ਕਰਿਪਟੋਗਰਾਫੀ, ID ਹੈ, ਜ ਸਬੂਤ ਮੈਟਾਡਾਟਾ");

        set(hex"F0", "ਬੰਦ-ਚੇਨ ਅਸਫਲ");
        set(hex"F1", "ਬੰਦ-ਚੇਨ ਸਫਲਤਾ");
        set(hex"F2", "ਦੀ ਉਡੀਕ ਬੰਦ-ਚੇਨ ਕਾਰਵਾਈ");
        set(hex"F3", "ਬੰਦ-ਚੇਨ ਕਾਰਵਾਈ ਸ਼ੁਰੂ");
        set(hex"F4", "ਬੰਦ-ਚੇਨ ਸੇਵਾ ਤੋਰ");
        set(hex"F5", "ਬੰਦ-ਚੇਨ ਕਾਰਵਾਈ ਦੀ ਲੋੜ ਹੈ");
        set(hex"F6", "ਬੰਦ-ਚੇਨ ਮਿਆਦ ਜ ਸੀਮਾ ਤੇ ਪਹੁੰਚ");
        set(hex"F8", "ਡੁਪਲੀਕੇਟ ਬੰਦ-ਚੇਨ ਬੇਨਤੀ");
        set(hex"FF", "ਬੰਦ-ਚੇਨ ਜਾਣਕਾਰੀ ਅਤੇ ਮੈਟਾ");
    }
}