pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract SerbianLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "Неуспех");
        set(hex"01", "успех");
        set(hex"02", "Очекујем Отхерс");
        set(hex"03", "прихваћен");
        set(hex"04", "Доња граница или недовољна");
        set(hex"05", "Пријемник Акција Тражени");
        set(hex"06", "Горња граница");
        set(hex"08", "Дупликат, Уннессесари, или Неважећа");
        set(hex"0F", "Информациони или метаподатака");

        set(hex"10", "Поништен или Стоп");
        set(hex"11", "Дозвољена или Го");
        set(hex"12", "Очекујем другим дозволу");
        set(hex"13", "dozvola је затражена");
        set(hex"14", "Превише Отвори / Несигурно");
        set(hex"15", "Треба дозвола или захтев за наставак");
        set(hex"16", "Поништити или Баннед");
        set(hex"18", "Не односи се на тренутном стању");
        set(hex"1F", "Дозвола Детаљи или под условима контролне");

        set(hex"20", "Нот Фоунд, неједнако, или ван домета");
        set(hex"21", "Забележено, Једнако или У домету");
        set(hex"22", "Очекујем Матцх");
        set(hex"23", "Матцх Захтев је послат");
        set(hex"24", "Испод Ранге или ундерфлов");
        set(hex"25", "Захтев за Матцх");
        set(hex"26", "Изнад Ранге или Оверфлов");
        set(hex"28", "Дупликат, Сукоб, судар или");
        set(hex"2F", "Одговарајући Мета или Инфо");

        set(hex"30", "Сендер се не слаже или Незапослен");
        set(hex"31", "Пошиљалац се слаже или Иеа");
        set(hex"32", "Очекујем Ратификација");
        set(hex"33", "Понуда Сент или Гласао");
        set(hex"34", "Кворум није постигнут");
        set(hex"35", "Примаоца Ратификација Тражени");
        set(hex"36", "Понуда или глас Лимит Реацхед");
        set(hex"38", "već је гласао");
        set(hex"3F", "Преговарања Правила или Учешће информације");

        set(hex"40", "недоступан");
        set(hex"41", "Доступан");
        set(hex"42", "Паузирано");
        set(hex"43", "куеуед");
        set(hex"44", "Још нису доступни");
        set(hex"45", "Очекујем доступности");
        set(hex"46", "истекао");
        set(hex"48", "Већ обављено");
        set(hex"4F", "Доступност Правила или информације (нпр. Време од или до)");

        set(hex"50", "prenos није успео");
        set(hex"51", "Пребаци Успешна");
        set(hex"52", "Чека се уплата од других");
        set(hex"53", "Холд или Есцров");
        set(hex"54", "Недовољно средстава");
        set(hex"55", "sredstva Тражени");
        set(hex"56", "Трансфер Том Екцеедед");
        set(hex"58", "Средства Није Потребан");
        set(hex"5F", "Токен или финансијске информације");

        set(hex"A0", "Апп-Специфична Неуспех");
        set(hex"A1", "Апп-Специфична Успех");
        set(hex"A2", "Апп-Специфиц Чекање Остало");
        set(hex"A3", "Апп-Специфична Прихватање");
        set(hex"A4", "Апп-Специфична Испод Стање");
        set(hex"A5", "Апп-Специфична пријемник Акција Тражени");
        set(hex"A6", "Апп-Специфична истека или лимит");
        set(hex"A8", "Апп-Специфична Неважећа Стање");
        set(hex"AF", "Апп-Специфична Мета 'или информације");

        set(hex"E0", "decrypt Фаилуре");
        set(hex"E1", "decrypt Суццесс");
        set(hex"E2", "Очекујем и други потписи или Кеис");
        set(hex"E3", "Потписан");
        set(hex"E4", "Унсигнед или непоузданом");
        set(hex"E5", "Потпис Потребан");
        set(hex"E6", "Познато је да се Угрожена");
        set(hex"E8", "Већ Сигнед или није кодиран");
        set(hex"EF", "Цриптограпхи, ИД или Прооф Метадата");

        set(hex"F0", "Офф-Цхаин Фаилуре");
        set(hex"F1", "Офф-Цхаин Суццесс");
        set(hex"F2", "Очекујем офф-Ланац Процес");
        set(hex"F3", "Процес офф-Ланац Стартед");
        set(hex"F4", "Офф-Цхаин Сервице Недоступна");
        set(hex"F5", "Офф-Цхаин Акција Обавезно");
        set(hex"F6", "Офф-Цхаин истека или лимит реацхед");
        set(hex"F8", "Дуплицате офф-Ланац Упит");
        set(hex"FF", "Офф-Цхаин Инфо или Мета");
    }
}