pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract SindhiLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "ناڪاميء");
        set(hex"01", "ڪاميابي");
        set(hex"02", "ٻيا جو منتظر");
        set(hex"03", "قبول");
        set(hex"04", "لاڙ پڄاڻي يا پورين");
        set(hex"05", "رسيور ايڪشن درخواست");
        set(hex"06", "اپر پڄاڻي");
        set(hex"08", "نقل، Unnessesary، يا Inapplicable");
        set(hex"0F", "معلومات يا بازارن ۾");

        set(hex"10", "نھ يا اسٽاپ");
        set(hex"11", "جي اجازت يا وڃ");
        set(hex"12", "ٻين جي حڪم جو منتظر");
        set(hex"13", "موڪل جي درخواست");
        set(hex"14", "به کوليو / رهيو");
        set(hex"15", "تسلسل لاء توهان جي اجازت يا درخواست جي ضرورت");
        set(hex"16", "رد يا پابندي");
        set(hex"18", "موجوده رياست لاء قابل اطلاق ڪونه");
        set(hex"1F", "حڪم تفصيل يا ڪنٽرول حالتون");

        set(hex"20", "نه ڏٺائين، آزاداڻي، يا مان حد");
        set(hex"21", "ڏٺائين، ناتو آهي يا رينج ۾");
        set(hex"22", "ادل جو منتظر");
        set(hex"23", "شاديء جي درخواست موڪلي وئي");
        set(hex"24", "حد يا Underflow هيٺ");
        set(hex"25", "شاديء لاء درخواست");
        set(hex"26", "حد تپائبا مٿي");
        set(hex"28", "نقل، مناقب، يا جي ٻڏي وڃڻ");
        set(hex"2F", "سميلن تبديل يا ڄاڻ");

        set(hex"30", "مرسل ڪر۽سندس يا بلڪ");
        set(hex"31", "مرسل رکي يا ھائو اسانکي پنھنجي");
        set(hex"32", "جي پڪي ڪرڻ جو منتظر");
        set(hex"33", "توبهه موڪليان يا نه ڏيئي");
        set(hex"34", "Quorum نه پھتي");
        set(hex"35", "رسيور جي پڪي ڪرڻ جي درخواست");
        set(hex"36", "توبهه يا ووٽ جي وڌ حد تي پهچي");
        set(hex"38", "اڳ ۾ ئي ڏيئي");
        set(hex"3F", "ڳالهين جا اصول، يا شموليت جي ڄاڻ");

        set(hex"40", "دستياب");
        set(hex"41", "موجود");
        set(hex"42", "رڪيل");
        set(hex"43", "Queued");
        set(hex"44", "اڃان موجود نه");
        set(hex"45", "توهان جي دستيابي جو منتظر");
        set(hex"46", "مدو");
        set(hex"48", "اڳواٽ ڪيل");
        set(hex"4F", "دستيابي رولز يا ڄاڻ (اڳوڻن. وٺي يا ايتري وقت)");

        set(hex"50", "جي منتقلي ۾ ناڪامي ٿي");
        set(hex"51", "منتقل ڇٽڻ");
        set(hex"52", "ٻين کان ادائگي جو منتظر");
        set(hex"53", "وٺو يا ايسڪرو");
        set(hex"54", "پورين پئسن");
        set(hex"55", "درخواست پئسن");
        set(hex"56", "جي منتقلي جلد کان لنگھندڙ");
        set(hex"58", "پئسن جي ضرورت نه");
        set(hex"5F", "ٽوڪن يا مالي معلومات");

        set(hex"A0", "ائپ-مخصوص ناڪامي");
        set(hex"A1", "ائپ-مخصوص ڪامياب");
        set(hex"A2", "ائپ-مخصوص ٻيا انطظاري");
        set(hex"A3", "ائپ-مخصوص قبوليت جو");
        set(hex"A4", "ائپ-مخصوص حالت هيٺ");
        set(hex"A5", "ائپ-مخصوص رسيور ايڪشن درخواست");
        set(hex"A6", "ائپ-مخصوص چونڊجڻ يا پڄاڻي");
        set(hex"A8", "ائپ-مخصوص Inapplicable حالت");
        set(hex"AF", "ائپ-مخصوص تبديل يا ڄاڻ");

        set(hex"E0", "ناڪامي Decrypt");
        set(hex"E1", "ڪامياب Decrypt");
        set(hex"E2", "ٻيا ويچار ونڊيو يا ڪنجيون جو منتظر");
        set(hex"E3", "پير");
        set(hex"E4", "Unsigned يا Untrusted");
        set(hex"E5", "صحيح ضروري");
        set(hex"E6", "Compromised ڪري به سڃاتو وڃي");
        set(hex"E8", "اڳ ۾ يا سائن نه خراب");
        set(hex"EF", "Cryptography، سڃاڻپ، يا ثبوت سڀني بازارن ۾");

        set(hex"F0", "بند-سند ناڪامي");
        set(hex"F1", "بند-سند ڪامياب");
        set(hex"F2", "سهاري مٽ-سند پروسيس");
        set(hex"F3", "بند-زنجير جو عمل شروع");
        set(hex"F4", "بند-سند جي سروس Unreachable");
        set(hex"F5", "بند-سند ايڪشن گھربل");
        set(hex"F6", "بند-سند چونڊجڻ يا وڌ حد تي پهچي");
        set(hex"F8", "جھڙا آھن مٽ-سند درخواست");
        set(hex"FF", "بند-زنجير ڄاڻ يا تبديل");
    }
}