pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract Sinhala, SinhaleseLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "අසමත් වීම");
        set(hex"01", "සාර්ථකත්වය");
        set(hex"02", "තවත් සමහරු බලා සිටින");
        set(hex"03", "පිළිගත්තා");
        set(hex"04", "අඩු සීමාව හෝ ප්රමාණවත්");
        set(hex"05", "ලබන්නා ක්රියාකාරී ඉල්ලන");
        set(hex"06", "ඉහළ සීමාව");
        set(hex"08", "අනුපිටපත්, Unnessesary, හෝ අනවශ");
        set(hex"0F", "සරළ හෝ පාරදත්ත");

        set(hex"10", "භව්ය ලෙසින් හෝ නවත්වන්න");
        set(hex"11", "ඉඩදී හෝ යන්න");
        set(hex"12", "වෙනත් ඉඩහැරීමෙන් තෙක් බලා");
        set(hex"13", "අවසර ඉල්ලන");
        set(hex"14", "ද විවෘත / අනාරක්ෂිත");
        set(hex"15", "තවදුරටත් සඳහා ඔබගේ අවසරය හෝ ඉල්ලීම් අවශ්ය");
        set(hex"16", "අවලංගු හෝ තහනම්");
        set(hex"18", "වර්තමාන තත්වය දක්වා අදාල නොවේ");
        set(hex"1F", "අවසර විස්තර හෝ Control කොන්දේසි");

        set(hex"20", "හමු නොවිනි, අසමාන, හෝ න් රංගේ");
        set(hex"21", "සොයා, සමාන හෝ රංගේ දී");
        set(hex"22", "බලා සිටින තරගයේ");
        set(hex"23", "යැවූ තරගයේ ඉල්ලීම්");
        set(hex"24", "රංගේ හෝ Underflow පහත");
        set(hex"25", "තරගයේ ඉල්ලීම");
        set(hex"26", "ඉහත රංගේ හෝ පමාණය");
        set(hex"28", "අනුපිටපත්, ගැටුම්, හෝ ගැටීම");
        set(hex"2F", "ගැලපෙන මෙටා හෝ තොරතුරු");

        set(hex"30", "යවන්නාගේ එකග නොවන හෝ සම්පූර්ණයෙන්ම මෝඩ");
        set(hex"31", "යවන්නාගේ එකඟ හෝ එසේ කරන්ට");
        set(hex"32", "ජාතීන් අනුමත කරන තෙක් බලා");
        set(hex"33", "ඉදිරිපත් යැවූ හෝ ඡන්දය දුන්නේ");
        set(hex"34", "ගණපූරණය එළඹ නැති");
        set(hex"35", "ලබන්නා විසින් අනුමත කොට ඉල්ලන");
        set(hex"36", "ඉදිරිපත් හෝ ඡන්දය සීමාව කරා");
        set(hex"38", "දැනටමත් ඡන්දය දුන්නේ");
        set(hex"3F", "සාකච්ඡාමය රීති හෝ සහභාගිත්වය තොරතුරු");

        set(hex"40", "භාවිතය සඳහා නොමැති");
        set(hex"41", "ඇත");
        set(hex"42", "තාවකාලිකව නවතා");
        set(hex"43", "පෙළ ගැසෙනු");
        set(hex"44", "එහෙත් ෙනොමැත");
        set(hex"45", "ඔබේ ලැබිය හැකි තෙක් බලා");
        set(hex"46", "කල් ඉකුත්");
        set(hex"48", "මේ වන විටත් සිදු කරන ලදි");
        set(hex"4F", "ලබා ගත හැකි රීති හෝ තොරතුරු (සිට හෝ තෙක් හිටපු. කාලය)");

        set(hex"50", "මාරු අසාර්ථක විය");
        set(hex"51", "සාර්ථක මාරු");
        set(hex"52", "අනිත් අයගෙන් ගෙවීම් තෙක් බලා");
        set(hex"53", "පැවැත්වීමට හෝ escrow");
        set(hex"54", "ප්රමාණවත් නොවන අරමුදල්");
        set(hex"55", "ඉල්ලන මුදල්");
        set(hex"56", "මාරු වෙළුම ඉක්මවා");
        set(hex"58", "අරමුදල් අවශ්ය නොවේ");
        set(hex"5F", "සංකේත හෝ මූල්ය තොරතුරු");

        set(hex"A0", "යෙදුම-විශේෂිත අපොහොසත් වීම");
        set(hex"A1", "යෙදුම-විශේෂිත සාර්ථකත්වය");
        set(hex"A2", "යෙදුම-විශේෂිත අන් අය අපේක්ෂාවෙන්");
        set(hex"A3", "යෙදුම-විශේෂිත පිළිගැනීම");
        set(hex"A4", "යෙදුම-විශේෂිත තත්වය පහත");
        set(hex"A5", "යෙදුම-විශේෂිත Receiver ක්රියාකාරී ඉල්ලන");
        set(hex"A6", "යෙදුම-විශේෂිත කල් ඉකුත් වීමේ හෝ සීමාව");
        set(hex"A8", "යෙදුම-විශේෂිත අනවශ තත්වය");
        set(hex"AF", "යෙදුම-විශේෂිත මෙටා හෝ තොරතුරු");

        set(hex"E0", "අපොහොසත් වීම විසංකේතනය");
        set(hex"E1", "සාර්ථකත්වය විසංකේතනය");
        set(hex"E2", "වෙනත් අත්සන් හෝ යතුරු තෙක් බලා");
        set(hex"E3", "අත්සන්");
        set(hex"E4", "නිලකුණු හෝ අවිශ්වාසයි");
        set(hex"E5", "අත්සන අවශ්ය");
        set(hex"E6", "හානිවිය දන්නා");
        set(hex"E8", "මේ වන විටත් අත්සන් හෝ නොවේ සංකේතාත්මක");
        set(hex"EF", "ගුප්ත ෙල්ඛන කලාව, ID, හෝ සනාථ කරන පාරදත්ත");

        set(hex"F0", "Off-දාම අපොහොසත් වීම");
        set(hex"F1", "Off-දාම සාර්ථකත්වය");
        set(hex"F2", "Off-දාම ක්රියාවලිය තෙක් බලා");
        set(hex"F3", "Off-දාම ක්රියාවලිය ආරම්භ");
        set(hex"F4", "Off-දාම සේවා පිවිසිය නොහැකි");
        set(hex"F5", "Off-දාම ක්රියාකාරී අවශ්ය");
        set(hex"F6", "Off-දාම කල් ඉකුත් වීමේ හෝ සීමාව ඉක්මවා ගොස්");
        set(hex"F8", "Off-දාම ඉල්ලීම් අනුපිටපත්");
        set(hex"FF", "Off-දාම තොරතුරු හෝ මෙටා");
    }
}