pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract TajikLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "нобарорӣ");
        set(hex"01", "муваффақият");
        set(hex"02", "мунтазири дигарон");
        set(hex"03", "ќабул");
        set(hex"04", "Ҳадди поёнӣ ё нокифояи");
        set(hex"05", "Қабулкунанда Чорабиниҳои дархостшаванда");
        set(hex"06", "Ҳадди болоии");
        set(hex"08", "Такрорӣ, Unnessesary, ё Inapplicable");
        set(hex"0F", "Иттилоотӣ ё Метадода");

        set(hex"10", "Disallowed ё Қатъи");
        set(hex"11", "Ичозат ё Биравед");
        set(hex"12", "Мунтазири Дигар кард Иљозати");
        set(hex"13", "Иљозати дархостшаванда");
        set(hex"14", "Низ Open / Хатарнок");
        set(hex"15", "Эњтиёљот Иљозати ё Дархост Шумо барои Идомаи");
        set(hex"16", "Ё бозхонд нашуда ё манъ");
        set(hex"18", "ба давлати кунунӣ истифода не");
        set(hex"1F", "Тафсилот Иљозати ё шароити назорати");

        set(hex"20", "Ёфт нашуд, нобаробари, ё берун аз диапазон аст");
        set(hex"21", "Ёфт, баробар ва ё дар диапазон");
        set(hex"22", "мунтазири Match");
        set(hex"23", "Бозии дархост ирсол шуд");
        set(hex"24", "Дар зер диапазон ё Underflow");
        set(hex"25", "Дархост барои Match");
        set(hex"26", "Пеш аз диапазон ё њиљрати");
        set(hex"28", "Такрорӣ, Низоъ ё бархӯрд");
        set(hex"2F", "Таин Meta ё INFO");

        set(hex"30", "Розӣ Интиќолдињанда ё На");
        set(hex"31", "Интиќолдињанда розӣ ё оре");
        set(hex"32", "мунтазири тасвиб");
        set(hex"33", "Пешниҳод ирсолшуда ё овоз");
        set(hex"34", "Кворум нарасида,");
        set(hex"35", "Тасвиб Қабулкунанда дархостшаванда");
        set(hex"36", "Пешниҳод ё Овози Ҳадди расид");
        set(hex"38", "Аллакай овоз");
        set(hex"3F", "Қоидаҳои гуфтушунид ё INFO Иштироки");

        set(hex"40", "дастнорас");
        set(hex"41", "дастрас");
        set(hex"42", "Таваққуф");
        set(hex"43", "Queued");
        set(hex"44", "Не мављуда, вале");
        set(hex"45", "Мунтазири Мавҷудияти Шумо");
        set(hex"46", "гузашта");
        set(hex"48", "Аллакай Шуд");
        set(hex"4F", "Қоидаҳои Дастрасӣ ё INFO (собиқ. Бор аз замони ё то)");

        set(hex"50", "Интиқол ноком");
        set(hex"51", "Ирсол муваффақонаи");
        set(hex"52", "Мунтазири пардохти Аз дигарон");
        set(hex"53", "Доред ё Escrow");
        set(hex"54", "Фондҳои нокифояи");
        set(hex"55", "Маблағҳои дархостшаванда");
        set(hex"56", "Интиқоли ҷилди зиёд");
        set(hex"58", "Маблағҳои талаб карда намешавад");
        set(hex"5F", "Маълумот нишона ё молиявӣ");

        set(hex"A0", "Нокомӣ Барномасозони махсус");
        set(hex"A1", "Муваффақият Барномасозони махсус");
        set(hex"A2", "Барномасозони махсус мунтазири дигарон");
        set(hex"A3", "Қабули Барномасозони махсус");
        set(hex"A4", "Барномасозони мушаххаси зер Аҳволи");
        set(hex"A5", "Барномасозони махсус Қабулкунанда Чорабиниҳои дархостшаванда");
        set(hex"A6", "Барномасозони махсус саромадан ё Ҳадди");
        set(hex"A8", "Барномасозони махсус ҳолати Inapplicable");
        set(hex"AF", "Барномасозони махсус Meta ё INFO");

        set(hex"E0", "рамзкушої Нокомӣ");
        set(hex"E1", "рамзкушої муваффақият");
        set(hex"E2", "Мунтазири Имзои дигар ё Калидҳо");
        set(hex"E3", "ба имзо расид");
        set(hex"E4", "Имзо карда ва ё бояд мутмаъин бошед");
        set(hex"E5", "имзо талаб");
        set(hex"E6", "Маълум осеб бубинад");
        set(hex"E8", "Аллакай имзо ё не рамзгузошташуда");
        set(hex"EF", "Хати рамзц, ID, ё Метадода Исботи");

        set(hex"F0", "Хомӯш-занҷираи Нокомӣ");
        set(hex"F1", "Хомӯш-занҷираи Муваффақият");
        set(hex"F2", "Мунтазири Хомӯш-занҷираи раванд");
        set(hex"F3", "Раванди Хомӯш-занҷираи оғоз");
        set(hex"F4", "Хомӯш-занҷираи Хадамоти Unreachable");
        set(hex"F5", "Хомӯш-занҷираи Чорабиниҳои ҳатмӣ");
        set(hex"F6", "Хомӯш-занҷираи саромадан ё мањдуд расид");
        set(hex"F8", "Ду нусха кардани Хомӯш-занҷираи Дархост");
        set(hex"FF", "Хомӯш-занҷираи INFO ё Meta");
    }
}