pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract TamilLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "தோல்வி");
        set(hex"01", "வெற்றி");
        set(hex"02", "மற்றவர்கள் காத்திருக்கிறது");
        set(hex"03", "ஏற்கப்பட்டது");
        set(hex"04", "லோவர் எல்லை அல்லது போதிய");
        set(hex"05", "ரிசீவர் அதிரடி கோரப்பட்டது");
        set(hex"06", "உச்ச வரம்பு");
        set(hex"08", "டூப்ளிகேட், Unnessesary, அல்லது பொருந்தாத");
        set(hex"0F", "தகவல்வகையானது அல்லது மெட்டாடேட்டா");

        set(hex"10", "அனுமதியற்ற அல்லது நிறுத்து");
        set(hex"11", "அனுமதிக்கப்பட்ட அல்லது போய்");
        set(hex"12", "வேறொருவரின் அனுமதி காத்திருக்கிறது");
        set(hex"13", "அனுமதி கோரப்பட்டது");
        set(hex"14", "மிக திற / பாதுகாப்பற்ற");
        set(hex"15", "தொடர்ந்து உங்கள் அனுமதி அல்லது வேண்டுகோள் நீட்ஸ்");
        set(hex"16", "திரும்பப்பெறப்பட்டது அல்லது தடை");
        set(hex"18", "தற்போதைய மாநில பொருந்தாது");
        set(hex"1F", "அனுமதி விவரங்கள் அல்லது Control நிபந்தனைகள்");

        set(hex"20", ", அனீக்வல் இல்லை, அல்லது வரம்புக்கு வெளியே இல்லை");
        set(hex"21", "கண்டுபிடிக்கப்பட்டுள்ளது சம அல்லது வரம்பில் உள்ள");
        set(hex"22", "போட்டி காத்திருக்கிறது");
        set(hex"23", "போட்டி வேண்டுகோள் அனுப்பப்பட்டது");
        set(hex"24", "ரேஞ்ச் அல்லது குறையோட்டம் கீழே");
        set(hex"25", "போட்டி கோரிக்கை");
        set(hex"26", "ரேஞ்ச் அல்லது அளவிற்கதிகமாக மேலாக");
        set(hex"28", "டூப்ளிகேட், மோதல், அல்லது மோதல்");
        set(hex"2F", "மெட்டா அல்லது தகவல் பொருந்தும்");

        set(hex"30", "அனுப்புநர் ஏற்கவில்லை அல்லது அப்படியல்ல");
        set(hex"31", "அனுப்புநர் ஒப்புதல் அல்லது ஆம்");
        set(hex"32", "காத்திருக்கிறது ஒப்புதலும்");
        set(hex"33", "ஆஃபர் அனுப்பப்பட்டது அல்லது வாக்களித்தார்");
        set(hex"34", "குவாரம் அடைந்தது இல்லை");
        set(hex"35", "ரிசீவர் ஒப்புதலும் கோரப்பட்டது");
        set(hex"36", "ஆஃபர் அல்லது வாக்களியுங்கள் வரையறையை எட்டியுள்ளது");
        set(hex"38", "முன்பே வாக்களித்தார்");
        set(hex"3F", "செலாவணியானது விதிகள் அல்லது பங்கேற்பு தகவல்");

        set(hex"40", "கிடைக்கவில்லை");
        set(hex"41", "கிடைக்கும்");
        set(hex"42", "இடைநிறுத்தப்பட்டது");
        set(hex"43", "வரிசையாக்கப்பட்டது");
        set(hex"44", "கிடைக்கவில்லை ஆயினும்");
        set(hex"45", "உங்கள் கிடைக்கும் காத்திருக்கிறது");
        set(hex"46", "காலாவதியான");
        set(hex"48", "முன்பே முடிந்தது");
        set(hex"4F", "கிடைக்கும் விதிகள் அல்லது தகவல் (முன்னாள் பாதித்து அல்லது வரை. நேரம்)");

        set(hex"50", "மாற்றம் தோல்வி");
        set(hex"51", "வெற்றிகரமான மாற்றம்");
        set(hex"52", "மற்றவர்கள் இருந்து கொடுப்பனவு காத்திருக்கிறது");
        set(hex"53", "பிடி அல்லது எஸ்க்ரோ");
        set(hex"54", "போதுமான பணம் இல்லை");
        set(hex"55", "நிதி கோரப்பட்டது");
        set(hex"56", "மாற்றம் தொகுதி மீறப்பட்டது");
        set(hex"58", "நிதி தேவையில்லை");
        set(hex"5F", "டோக்கன் அல்லது நிதி தகவல்கள்");

        set(hex"A0", "ஆப்-குறிப்பிட்ட தோல்வி");
        set(hex"A1", "ஆப்-குறிப்பிட்ட வெற்றி");
        set(hex"A2", "ஆப்-குறிப்பிட்ட காத்திருக்கிறது மற்றவர்கள்");
        set(hex"A3", "ஆப்-குறிப்பிட்ட ஏற்பு");
        set(hex"A4", "நிபந்தனை கீழே ஆப்-குறிப்பிட்ட");
        set(hex"A5", "ஆப்-குறிப்பிட்ட ரிசீவர் அதிரடி கோரப்பட்டது");
        set(hex"A6", "ஆப்-குறிப்பிட்ட காலாவதியாகும் அல்லது எல்லை");
        set(hex"A8", "ஆப்-குறிப்பிட்ட பொருந்தாத கண்டிஷன்");
        set(hex"AF", "ஆப்-குறிப்பிட்ட மெட்டா அல்லது தகவல்");

        set(hex"E0", "தோல்வி மறைவிலக்கம்");
        set(hex"E1", "வெற்றி மறைவிலக்கம்");
        set(hex"E2", "மற்ற கையொப்பங்கள் அல்லது கீஸ் காத்திருக்கிறது");
        set(hex"E3", "கையொப்பமிடப்பட்ட");
        set(hex"E4", "கையொப்பமிடாத அல்லது நம்பகமில்லாதது");
        set(hex"E5", "கையொப்பம் தேவை");
        set(hex"E6", "திருடப்பட்டுள்ளது என அறியப்படுகின்றன");
        set(hex"E8", "முன்பே கையொப்பமிடப்பட்ட மறைகுறியாக்கப்பட்டதா அல்லது இல்லையா");
        set(hex"EF", "கிரிப்டோகிராஃபி, ID அல்லது சான்று மெட்டாடேட்டா");

        set(hex"F0", "இனிய செயின் தோல்வி");
        set(hex"F1", "இனிய செயின் வெற்றி");
        set(hex"F2", "காத்திருக்கிறது இனிய செயின் செயல்முறை");
        set(hex"F3", "இனிய செயின் செயல்முறை தொடங்கியது");
        set(hex"F4", "இனிய செயின் சேவை அடையமுடியவில்லை");
        set(hex"F5", "இனிய செயின் அதிரடி தேவையான");
        set(hex"F6", "இனிய செயின் காலாவதியாகும் அல்லது வரையறையை எட்டியுள்ளது");
        set(hex"F8", "-செயின் ஆஃப் வேண்டுகோள் நகல்");
        set(hex"FF", "இனிய செயின் தகவல் அல்லது மெட்டா");
    }
}