pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract TeluguLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "వైఫల్యం");
        set(hex"01", "విజయం");
        set(hex"02", "ఇతరత్రా అందించనివారు");
        set(hex"03", "ఆమోదించబడిన");
        set(hex"04", "దిగువ పరిమితి లేదా సరిపోని");
        set(hex"05", "స్వీకర్త యాక్షన్ అభ్యర్థించిన");
        set(hex"06", "గరిష్ట పరిమితి");
        set(hex"08", "నకిలీ, Unnessesary, లేదా వర్తించదగని");
        set(hex"0F", "ఇంఫర్మేషనల్ లేదా మెటాడేటా");

        set(hex"10", "అనుమతించలేదు లేదా ఆపు");
        set(hex"11", "అనుమతి లేదా వెళ్ళండి");
        set(hex"12", "ఇతర అనుమతి కోసం వేచి ఉన్నా");
        set(hex"13", "అనుమతి విజ్ఞప్తి");
        set(hex"14", "చాలా ఓపెన్ / అసురక్ష");
        set(hex"15", "కొనసాగింపు కోసం మీ అనుమతి లేదా అభ్యర్థన నీడ్స్");
        set(hex"16", "రద్దు లేదా నిషేధించారు");
        set(hex"18", "ప్రస్తుత రాష్ట్రం వర్తించవని");
        set(hex"1F", "అనుమతి వివరాలు లేదా కంట్రోల్ పరిస్థితులు");

        set(hex"20", ", అసమాన దొరకలేదు, లేదా రేంజ్ అవుట్ లేదు");
        set(hex"21", "దొరకలేదు, సమాన లేదా రేంజ్ లో");
        set(hex"22", "మ్యాచ్ కోసం వేచి ఉన్నా");
        set(hex"23", "మ్యాచ్ విన్నపం పంపబడింది");
        set(hex"24", "రేంజ్ లేదా తక్కువ ప్రవాహం క్రింద");
        set(hex"25", "మ్యాచ్ కోసం అభ్యర్థన");
        set(hex"26", "రేంజ్ లేదా ఫ్లో పైన");
        set(hex"28", "నకిలీ, కాన్ఫ్లిక్ట్, లేదా తాకిడి");
        set(hex"2F", "సరిపోలే మెటా లేదా సమాచారం");

        set(hex"30", "పంపినవారు అంగీకరించకపోతే లేదా Nay");
        set(hex"31", "పంపినవారు అంగీకరించింది లేదా అవును");
        set(hex"32", "అందించనివారు ఆమోద");
        set(hex"33", "ఆఫర్ పంపిన ఓటు");
        set(hex"34", "కోరం చేరుకోలేదు");
        set(hex"35", "స్వీకర్త యొక్క ఆమోద అభ్యర్థించిన");
        set(hex"36", "ఆఫర్ లేదా ఓట్ పరిమితికి చేరుకున్నది");
        set(hex"38", "ఇప్పటికే ఓటు వేసారు");
        set(hex"3F", "నెగోషియేషన్ రూల్స్ లేదా పార్టిసిపేషన్ సమాచారం");

        set(hex"40", "అందుబాటులో");
        set(hex"41", "అందుబాటులో");
        set(hex"42", "పాజ్");
        set(hex"43", "క్యూలో");
        set(hex"44", "ప్రస్తుతానికి అందుబాటులో లేదు");
        set(hex"45", "మీ అందుబాటు కొరకు వేచి వుంది");
        set(hex"46", "గడువు");
        set(hex"48", "ఎప్పుడో అయిపోయింది");
        set(hex"4F", "లభ్యత నిబంధనలు లేదా సమాచారం (ఉదా. నుండి లేదా వరకు సమయం)");

        set(hex"50", "బదిలీ విఫలమైంది");
        set(hex"51", "విజయవంతమైన బదిలీ");
        set(hex"52", "ఇతరుల నుండి చెల్లింపు కోసం వేచి");
        set(hex"53", "హోల్డ్ లేదా ఎస్క్రో");
        set(hex"54", "తగినన్ని నిధులు");
        set(hex"55", "ఫండ్స్ అభ్యర్థించిన");
        set(hex"56", "ట్రాన్స్ఫర్ వాల్యూమ్ మించింది");
        set(hex"58", "ఫండ్స్ అవసరములేదు");
        set(hex"5F", "టోకెన్ లేదా ఆర్థిక సమాచారాన్ని");

        set(hex"A0", "అనువర్తన-నిర్దిష్ట వైఫల్యం");
        set(hex"A1", "అనువర్తన-నిర్దిష్ట విజయం");
        set(hex"A2", "అనువర్తన-నిర్దిష్ట అందించనివారు ఇతరులు");
        set(hex"A3", "అనువర్తన-నిర్దిష్ట అంగీకారం");
        set(hex"A4", "కండిషన్ క్రింద అనువర్తన-నిర్దిష్ట");
        set(hex"A5", "అనువర్తన-నిర్దిష్ట స్వీకర్త యాక్షన్ అభ్యర్థించిన");
        set(hex"A6", "అనువర్తన-నిర్దిష్ట గడువు లేదా పరిమితం");
        set(hex"A8", "అనువర్తన-నిర్దిష్ట వర్తించదగని కండిషన్");
        set(hex"AF", "అనువర్తన-నిర్దిష్ట మెటా లేదా సమాచారం");

        set(hex"E0", "వైఫల్యం డీక్రిప్ట్");
        set(hex"E1", "సక్సెస్ డీక్రిప్ట్");
        set(hex"E2", "ఇతర సంతకాలు లేదా కీస్ కోసం వేచి ఉన్నా");
        set(hex"E3", "సంతకం");
        set(hex"E4", "సైన్ చేయని లేదా అవిశ్వసనీయ");
        set(hex"E5", "సంతకం అవసరం");
        set(hex"E6", "రాజీ అని పిలువబడుతున్న");
        set(hex"E8", "ఇప్పటికే సంతకం లేదా యెన్క్రిప్ట్");
        set(hex"EF", "క్రిప్టోగ్రఫీ, ID, లేదా ప్రూఫ్ మెటాడేటా");

        set(hex"F0", "ఆఫ్-చైన్ వైఫల్యం");
        set(hex"F1", "ఆఫ్-చైన్ విజయం");
        set(hex"F2", "అందించనివారు ఆఫ్-చైన్ ప్రాసెస్");
        set(hex"F3", "ఆఫ్-చైన్ ప్రక్రియను మొదలు");
        set(hex"F4", "ఆఫ్-చైన్ సర్వీస్ చేరుకోలేని");
        set(hex"F5", "ఆఫ్-చైన్ చర్యన");
        set(hex"F6", "ఆఫ్-చైన్ గడువు లేదా పరిమితికి చేరుకున్నది");
        set(hex"F8", "నకిలీ ఆఫ్-చైన్ అభ్యర్థన");
        set(hex"FF", "ఆఫ్-చైన్ సమాచారం లేదా మెటా");
    }
}