pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract ThaiLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "ความล้มเหลว");
        set(hex"01", "ความสำเร็จ");
        set(hex"02", "รอคนอื่น ๆ");
        set(hex"03", "ได้รับการยืนยัน");
        set(hex"04", "วงเงินที่ต่ำกว่าหรือไม่เพียงพอ");
        set(hex"05", "ผู้รับกระทำที่ร้องขอ");
        set(hex"06", "Upper Limit");
        set(hex"08", "ที่ซ้ำกัน, Unnessesary หรือไม่มีผลใช้บังคับ");
        set(hex"0F", "ข้อมูลหรือเมตาดาต้า");

        set(hex"10", "ไม่ได้รับอนุญาตหรือหยุด");
        set(hex"11", "อนุญาตหรือไป");
        set(hex"12", "รอการอื่น ๆ ได้รับอนุญาต");
        set(hex"13", "ขอการอนุญาต");
        set(hex"14", "เปิดเกินไป / ไม่ปลอดภัย");
        set(hex"15", "ต้องได้รับอนุญาตหรือคำขอของคุณสำหรับความต่อเนื่อง");
        set(hex"16", "เพิกถอนหรือห้าม");
        set(hex"18", "ไม่สามารถใช้ได้กับสถานะปัจจุบัน");
        set(hex"1F", "รายละเอียดเงื่อนไขการอนุญาตหรือการควบคุม");

        set(hex"20", "ไม่พบไม่เท่ากันหรือออกจากช่วง");
        set(hex"21", "พบที่เท่าเทียมกันหรืออยู่ในช่วง");
        set(hex"22", "รอการแข่งขัน");
        set(hex"23", "ตรงกับคำขอส่ง");
        set(hex"24", "ต่ำกว่าช่วงหรือ Underflow");
        set(hex"25", "ขอจบการแข่งขัน");
        set(hex"26", "ดังกล่าวข้างต้นหรือช่วงน้ำล้น");
        set(hex"28", "ที่ซ้ำกัน, ความขัดแย้งหรือการปะทะกัน");
        set(hex"2F", "จับคู่ Meta หรือข้อมูล");

        set(hex"30", "ไม่เห็นส่งหรือเปล่าเลย");
        set(hex"31", "ผู้ส่งตกลงหรือแท้จริงแล้ว");
        set(hex"32", "รอการให้สัตยาบัน");
        set(hex"33", "ข้อเสนอที่ถูกส่งหรือโหวต");
        set(hex"34", "องค์ประชุมไม่ถึง");
        set(hex"35", "การให้สัตยาบันของผู้รับการขอใช้บริการ");
        set(hex"36", "เสนอซื้อหรือโหวตถึงขีด จำกัด");
        set(hex"38", "โหวตแล้ว");
        set(hex"3F", "กฎการเจรจาต่อรองหรือข้อมูลการมีส่วนร่วม");

        set(hex"40", "ไม่มี");
        set(hex"41", "ที่มีจำหน่าย");
        set(hex"42", "หยุดชั่วคราว");
        set(hex"43", "อยู่ในคิว");
        set(hex"44", "ยังไม่พร้อม");
        set(hex"45", "รอความพร้อมของคุณ");
        set(hex"46", "หมดอายุ");
        set(hex"48", "เสร็จเรียบร้อย");
        set(hex"4F", "กฎความพร้อมใช้งานหรือข้อมูล (อดีต. และเวลาตั้งแต่หรือจนกว่า)");

        set(hex"50", "ถ่ายโอนล้มเหลว");
        set(hex"51", "โอนที่ประสบความสำเร็จ");
        set(hex"52", "รอการชำระเงินจากคนอื่น ๆ");
        set(hex"53", "ถือหรือ Escrow");
        set(hex"54", "เงินทุนไม่เพียงพอ");
        set(hex"55", "กองทุนการขอใช้บริการ");
        set(hex"56", "การถ่ายโอนปริมาณเกิน");
        set(hex"58", "กองทุนรวมที่ไม่จำเป็นต้องใช้");
        set(hex"5F", "ข้อมูล Token หรือการเงิน");

        set(hex"A0", "ความล้มเหลวเฉพาะแอป");
        set(hex"A1", "ที่ประสบความสำเร็จเฉพาะแอป");
        set(hex"A2", "เฉพาะแอปรออื่น ๆ");
        set(hex"A3", "การยอมรับเฉพาะแอป");
        set(hex"A4", "เฉพาะแอปด้านล่างสภาพ");
        set(hex"A5", "เฉพาะแอป Receiver กระทำที่ร้องขอ");
        set(hex"A6", "เฉพาะแอปหมดอายุหรือ จำกัด");
        set(hex"A8", "เฉพาะแอปสภาพไม่มีผลใช้บังคับ");
        set(hex"AF", "เฉพาะแอป Meta หรือข้อมูล");

        set(hex"E0", "ถอดรหัสความล้มเหลว");
        set(hex"E1", "ถอดรหัสความสำเร็จ");
        set(hex"E2", "รอลายเซ็นอื่น ๆ หรือคีย์");
        set(hex"E3", "ลงนาม");
        set(hex"E4", "ไม่ได้ลงนามหรือไม่น่าเชื่อถือ");
        set(hex"E5", "ลายเซ็นที่จำเป็น");
        set(hex"E6", "รู้จักที่จะบุกรุก");
        set(hex"E8", "แล้วลงนามหรือไม่ได้เข้ารหัส");
        set(hex"EF", "การเข้ารหัส, ID, หรือเมตาดาต้าหลักฐาน");

        set(hex"F0", "Off-Chain ความล้มเหลว");
        set(hex"F1", "Off-Chain ที่ประสบความสำเร็จ");
        set(hex"F2", "รอกระบวนการ Off-Chain");
        set(hex"F3", "กระบวนการ Off-Chain เริ่มต้น");
        set(hex"F4", "Off-Chain บริการไม่สามารถเข้าถึงได้");
        set(hex"F5", "Off-Chain การดำเนินการที่จำเป็น");
        set(hex"F6", "Off-Chain หมดอายุหรือถึงขีด จำกัด");
        set(hex"F8", "ซ้ำ Off-Chain ขอ");
        set(hex"FF", "Off-Chain ข้อมูลหรือเมตาดาต้า");
    }
}