pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract UkrainianLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "недостатність");
        set(hex"01", "успіх");
        set(hex"02", "В очікуванні Інші");
        set(hex"03", "прийнято");
        set(hex"04", "Нижня межа або Недостатній");
        set(hex"05", "Приймач Дія Запитаний");
        set(hex"06", "Верхня межа");
        set(hex"08", "Дублікат, Unnessesary або не застосовується");
        set(hex"0F", "Інформаційний або метаданих");

        set(hex"10", "Неприпустимий або зупинка");
        set(hex"11", "Дозволено чи Go");
        set(hex"12", "Очікування Іншого Дозвіл");
        set(hex"13", "дозвіл Запитаний");
        set(hex"14", "Занадто Відкрити / небезпечною");
        set(hex"15", "Потрібен дозвіл або запиту для продовження");
        set(hex"16", "Відкликана або Banned");
        set(hex"18", "Не застосовується до поточного стану");
        set(hex"1F", "Введена деталь або управління Умова");

        set(hex"20", "Чи не знайдено, нерівної або поза діапазону");
        set(hex"21", "Знайдено, рівні або в діапазоні");
        set(hex"22", "В очікуванні матчу");
        set(hex"23", "Матч Запит відправлений");
        set(hex"24", "Нижче діапазону або Underflow");
        set(hex"25", "Запит на матч");
        set(hex"26", "Вище діапазон або переповнення");
        set(hex"28", "Дублікат, конфлікт або зіткнення");
        set(hex"2F", "Відповідність Meta або інформація");

        set(hex"30", "Відправник ЗГОДЕН або Най");
        set(hex"31", "Відправник погоджується з тим або Yea");
        set(hex"32", "В очікуванні ратифікації");
        set(hex"33", "Пропозиція Відправлені або Проголосували");
        set(hex"34", "Кворум яка не досягла");
        set(hex"35", "Ратифікація приймача Запитаний");
        set(hex"36", "Пропозиція або Vote досягло межі");
        set(hex"38", "уже Проголосували");
        set(hex"3F", "Переговорні правила або участь інформація");

        set(hex"40", "недоступний");
        set(hex"41", "наявний");
        set(hex"42", "припинено");
        set(hex"43", "Queued");
        set(hex"44", "Чи не доступна");
        set(hex"45", "В очікуванні Вашої Availability");
        set(hex"46", "закінчився");
        set(hex"48", "Вже зроблено");
        set(hex"4F", "Наявність правила або інформація (напр., Час з моменту або до)");

        set(hex"50", "збій передачі");
        set(hex"51", "перенести Успішна");
        set(hex"52", "В очікуванні оплати від інших");
        set(hex"53", "Утримувати або Escrow");
        set(hex"54", "Недостатньо коштів");
        set(hex"55", "засоби Запитаний");
        set(hex"56", "Передача Обсяг Перевищено");
        set(hex"58", "Засоби Не потрібно");
        set(hex"5F", "Токен або фінансова інформація");

        set(hex"A0", "App-Specific Failure");
        set(hex"A1", "App-Specific успіху");
        set(hex"A2", "App-Конкретні Очікують Інші");
        set(hex"A3", "App-Specific Приймання");
        set(hex"A4", "App-Specific Нижче умови");
        set(hex"A5", "App-Specific приймач Дія Запитаний");
        set(hex"A6", "Додаток Специфічні експірації або межа");
        set(hex"A8", "App-Specific незастосовні Стан");
        set(hex"AF", "App-Specific Meta або інформація");

        set(hex"E0", "розшифрувати Failure");
        set(hex"E1", "розшифрувати успіх");
        set(hex"E2", "Очікування Інших підписів або ключів");
        set(hex"E3", "підписаний");
        set(hex"E4", "Unsigned або ненадійний");
        set(hex"E5", "підпис Обов'язковий");
        set(hex"E6", "Відомий бути Ослаблений");
        set(hex"E8", "Уже підписано або не зашифровані");
        set(hex"EF", "Криптографія, ідентифікатор або Доказ метаданих");

        set(hex"F0", "Off-Chain Failure");
        set(hex"F1", "Off-ланцюга успіху");
        set(hex"F2", "Очікування поза технологічного ланцюжка");
        set(hex"F3", "Офф-ланцюга Процес роботи");
        set(hex"F4", "Off-Chain Service Недоступний");
        set(hex"F5", "Off-ланцюга Необхідні дії");
        set(hex"F6", "Off-Chain закінчення терміну дії або досягнута межа");
        set(hex"F8", "Дублікат Off-Chain Request");
        set(hex"FF", "Off-Chain Info або Meta");
    }
}