pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract UrduLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "ناکامی");
        set(hex"01", "کامیابی");
        set(hex"02", "دوسروں کا انتظار ہے");
        set(hex"03", "قبول کر لیا");
        set(hex"04", "کم حد یا ناکافی");
        set(hex"05", "وصول ایکشن درخواست");
        set(hex"06", "اوپری کی حد");
        set(hex"08", "نقل، Unnessesary، یا ناقابل اطلاق");
        set(hex"0F", "معلوماتی یا میٹا ڈیٹا");

        set(hex"10", "منع یا روکنے");
        set(hex"11", "اجازت ہے یا جائیں");
        set(hex"12", "دیگر کی اجازت کا انتظار ہے");
        set(hex"13", "اجازت طلب");
        set(hex"14", "غیر محفوظ بھی کھلی /");
        set(hex"15", "تسلسل کے لئے آپ کی اجازت یا درخواست کی ضرورت");
        set(hex"16", "منسوخ یا کالعدم");
        set(hex"18", "موجودہ ریاست پر لاگو نہیں");
        set(hex"1F", "اجازت تفصیلات یا کنٹرول ضوابط");

        set(hex"20", "غیر مساوی ملا، یا حد سے باہر نہیں");
        set(hex"21", "ملا، برابر یا رینج میں");
        set(hex"22", "میچ کا انتظار ہے");
        set(hex"23", "میچ درخواست بھیجی");
        set(hex"24", "رینج یا Underflow ذیل");
        set(hex"25", "میچ کے لیے درخواست");
        set(hex"26", "رینج یا اتپرواہ کے اوپر");
        set(hex"28", "مثنی، تنازعہ، یا تصادم");
        set(hex"2F", "میٹا یا معلومات ملاپ");

        set(hex"30", "مرسل اتفاق نہیں یا اصل بات یہ ہے");
        set(hex"31", "مرسل اتفاق کرتے ہیں یا ہاں");
        set(hex"32", "انتظارہے توثیق");
        set(hex"33", "پیشکش بھیجا یا ووٹ");
        set(hex"34", "کورم تک نہیں پہنچی");
        set(hex"35", "وصول کی منظوری کی درخواست کی گئی");
        set(hex"36", "پیشکش یا ووٹ کی حد تک پہنچ");
        set(hex"38", "پہلے ہی ووٹ");
        set(hex"3F", "مذاکرات کے قواعد یا شرکت کی معلومات");

        set(hex"40", "دستیاب نہیں");
        set(hex"41", "دستیاب");
        set(hex"42", "موقوف");
        set(hex"43", "قطار بند");
        set(hex"44", "دستیاب نہیں ہے پھر بھی");
        set(hex"45", "آپ کی دستیابی کا انتظار ہے");
        set(hex"46", "میعاد ختم ہوگئی");
        set(hex"48", "پہلے ہی کر لیا گیا");
        set(hex"4F", "دستیابی رولز یا معلومات (مثال کے بعد یا جب تک. وقت)");

        set(hex"50", "منتقلی ناکام ہو گیا");
        set(hex"51", "کامیاب منتقلی");
        set(hex"52", "دوسروں سے ادائیگی کا انتظار ہے");
        set(hex"53", "پکڑو یا یسکرو");
        set(hex"54", "ناکافی فنڈز");
        set(hex"55", "فنڈز کی درخواست کی گئی");
        set(hex"56", "منتقلی حجم سے تجاوز");
        set(hex"58", "فنڈز کی ضرورت نہیں");
        set(hex"5F", "ٹوکن یا مالی معلومات");

        set(hex"A0", "ایپ کیلئے مخصوص ناکامی");
        set(hex"A1", "ایپ کیلئے مخصوص کامیابی");
        set(hex"A2", "ایپ کیلئے مخصوص انتظارہے دیگر");
        set(hex"A3", "ایپ کیلئے مخصوص قبولیت");
        set(hex"A4", "ذیل حالت ایپ کیلئے مخصوص");
        set(hex"A5", "ایپ کیلئے مخصوص وصول ایکشن درخواست");
        set(hex"A6", "ایپ کیلئے مخصوص ختم ہونے یا انہیں محدود");
        set(hex"A8", "ایپ کیلئے مخصوص ناقابل اطلاق حالت");
        set(hex"AF", "ایپ کیلئے مخصوص میٹا یا معلومات");

        set(hex"E0", "ناکامی بےرمز");
        set(hex"E1", "کامیابی بےرمز");
        set(hex"E2", "دیگر دستخط یا چابیاں انتظارہے");
        set(hex"E3", "سائن ان کردہ");
        set(hex"E4", "اہستاکشرت یا ناقابل بھروسہ");
        set(hex"E5", "دستخط کی ضرورت");
        set(hex"E6", "سمجھوتہ کیا جا کرنے کے لئے جانا جاتا ہے");
        set(hex"E8", "پہلے ہی دستخط یا نہیں مرموز");
        set(hex"EF", "خفیہ نگاری، ID، یا ثبوت میٹا ڈیٹا");

        set(hex"F0", "آف سلسلہ ناکامی");
        set(hex"F1", "آف سلسلہ کامیابی");
        set(hex"F2", "انتظارہے آف سلسلہ عمل");
        set(hex"F3", "آف سلسلہ عمل شروع");
        set(hex"F4", "آف سلسلہ سروس تک نہیں پہنچا جاسکتا");
        set(hex"F5", "آف سلسلہ کارروائی کی ضرورت");
        set(hex"F6", "آف سلسلہ ختم ہونے یا حد کو پہنچ");
        set(hex"F8", "نقل آف سلسلہ گذارش");
        set(hex"FF", "آف سلسلہ معلومات یا میٹا");
    }
}