pragma solidity ^0.5.0;

import "./FissionLocalization.sol";

contract YiddishLocalization is FissionLocalization {
    constructor() public {

        set(hex"00", "דורכפאַל");
        set(hex"01", "הצלחה");
        set(hex"02", "אַוואַיטינג אנדערע");
        set(hex"03", "אנגענומען");
        set(hex"04", "נידעריקער שיעור אָדער ניט גענוגיק");
        set(hex"05", "ופנעמער קאַמף געבעטן");
        set(hex"06", "אויבערשטער שיעור");
        set(hex"08", "דופּליקאַט, וננעססעסאַרי, אָדער ינאַפּפּליקאַבלע");
        set(hex"0F", "ינפאָרמאַטיאָנאַל אָדער מעטאדאטע");

        set(hex"10", "דיסאַללאָוועד אָדער האַלטן");
        set(hex"11", "ערלויבט אָדער גיין");
        set(hex"12", "אַוואַיטינג אנדערע ס דערלויבעניש");
        set(hex"13", "דערלויבעניש געבעטן");
        set(hex"14", "אויך עפֿן / ינסעקורע");
        set(hex"15", "דאַרף דיין דערלויבעניש אָדער בעטן פֿאַר קאַנטיניויישאַן");
        set(hex"16", "ריוואָוקט אָדער באַנד");
        set(hex"18", "צי האָט ניט אָנווענדלעך צו קראַנט שטאַט");
        set(hex"1F", "דערלויבעניש דעטאַילס אָדער קאָנטראָל קאָנדיטיאָנס");

        set(hex"20", "צי האָט ניט געפֿונען, ונעקוואַל, אָדער אויס פון ראַנגע");
        set(hex"21", "געפֿונען ווערן, עקוואַל אָדער אין ראַנגע");
        set(hex"22", "אַוואַיטינג מאַטש");
        set(hex"23", "מאַטש בעטן געשיקט");
        set(hex"24", "אונטן ראַנגע אָדער ונדערפלאָוו");
        set(hex"25", "בעטן פֿאַר מאַטש");
        set(hex"26", "אויבן ראַנגע אָדער לויפן");
        set(hex"28", "דופּליקאַט, געראַנגל, אָדער קאָלליסיאָן");
        set(hex"2F", "וואָס ריכטן זיך מעטאַ אָדער אינפֿאָרמאַציע");

        set(hex"30", "סענדער דיסאַגרעעס אָדער נייַ");
        set(hex"31", "סענדער אַגרעעס אָדער ייי");
        set(hex"32", "אַוואַיטינג ראַטיפיקאַטיאָן");
        set(hex"33", "פאָרשלאָגן געשיקט אָדער וואָטעד");
        set(hex"34", "קוואָרום ניט ריטשט");
        set(hex"35", "ופנעמער ס ראַטיפיקאַטיאָן געבעטן");
        set(hex"36", "פאָרשלאָגן אָדער שטימען לימיט ריטשט");
        set(hex"38", "שוין וואָטעד");
        set(hex"3F", "פאַרהאַנדלונג כּללים אָדער אָנטייל אינפֿאָרמאַציע");

        set(hex"40", "אַנאַוויילאַבאַל");
        set(hex"41", "פאַראַנען");
        set(hex"42", "פּאָזד");
        set(hex"43", "קוועועד");
        set(hex"44", "ניט בנימצא אבער");
        set(hex"45", "אַוואַיטינג דיין אַוואַילאַביליטי");
        set(hex"46", "אויסגעגאנגען");
        set(hex"48", "שוין געטאן");
        set(hex"4F", "אַוואַילאַביליטי רולעס אָדער אינפֿאָרמאַציע (עקס. מאָל זינט אָדער ביז)");

        set(hex"50", "אַריבערפירן געקענט");
        set(hex"51", "אַריבערפירן מצליח");
        set(hex"52", "אַוואַיטינג צאָלונג פֿון אנדערע");
        set(hex"53", "האַלטן אָדער עסקראָו");
        set(hex"54", "ניט גענוגיק געלט");
        set(hex"55", "געלט געבעטן");
        set(hex"56", "אַריבערפירן באנד עקססעעדעד");
        set(hex"58", "געלט ניט רעקווירעד");
        set(hex"5F", "סימען אָדער Financial אינפֿאָרמאַציע");

        set(hex"A0", "אַפּ-ספּעציפֿיש Failure");
        set(hex"A1", "אַפּ-ספּעציפֿיש הצלחה");
        set(hex"A2", "אַפּ-ספּעציפֿיש אַוואַיטינג אנדערע");
        set(hex"A3", "אַפּ-ספּעציפֿיש אַקסעפּטאַנסע");
        set(hex"A4", "אַפּ-ספּעציפֿיש ונטער קאַנדישאַן");
        set(hex"A5", "אַפּ-ספּעציפֿיש ריסיווער קאַמף געבעטן");
        set(hex"A6", "אַפּ-ספּעציפֿיש עקספּירי אָדער לימיט");
        set(hex"A8", "אַפּ-ספּעציפֿיש ינאַפּפּליקאַבלע קאַנדישאַן");
        set(hex"AF", "אַפּ-ספּעציפֿיש מעטאַ אָדער אינפֿאָרמאַציע");

        set(hex"E0", "דעקריפּט Failure");
        set(hex"E1", "דעקריפּט הצלחה");
        set(hex"E2", "אַוואַיטינג אנדערע סיגנאַטורעס אָדער קיז");
        set(hex"E3", "געחתמעט");
        set(hex"E4", "אַנסיינד אָדער ונטרוסטעד");
        set(hex"E5", "כסימע רעקווירעד");
        set(hex"E6", "באקאנט צו זיין קאָמפּראָמיסעד");
        set(hex"E8", "שוין געחתמעט אָדער ניט ענקריפּטעד");
        set(hex"EF", "קריפּטאָגראַפי, שייַן, אָדער פּרוף מעטאדאטע");

        set(hex"F0", "אַוועק-קייט Failure");
        set(hex"F1", "אַוועק-קייט הצלחה");
        set(hex"F2", "אַוואַיטינג אַוועק-קייט פּראַסעס");
        set(hex"F3", "אַוועק-קייט פּראַסעס אנגעהויבן");
        set(hex"F4", "אַוועק-קייט סערוויס ונרעאַטשאַבלע");
        set(hex"F5", "אַוועק-קייט קאַמף רעקווירעד");
        set(hex"F6", "אַוועק-קייט עקספּירי אָדער לימיט ריטשט");
        set(hex"F8", "דופּליקאַט אַוועק-קייט בעטן");
        set(hex"FF", "אַוועק-קייט אינפֿאָרמאַציע אָדער מעטאַ");
    }
}